[
  {
    "task_id": "E032",
    "description": "Imagine you're creating a meal plan for yourself and want to ensure you're getting the right amount of nutrients, but you also want to keep your budget in check. You're considering four different food items: Steak, Eggs, Pasta, and Chicken. Each of these food items has a different nutritional content and cost.\n\nHere's a brief overview of what each food item provides and how much it costs:\n\n- Steak: Provides you with 20 grams of protein, 2 grams of carbohydrates, and 68 calories for $4.\n- Eggs: Offer 7 grams of protein, 3 grams of carbohydrates, and 143 calories for just $1.\n- Pasta: Gives you 1 gram of protein, a large 26 grams of carbohydrates, and 52 calories for $9.\n- Chicken: Packs 10 grams of protein, 1 gram of carbohydrate, and 69 calories for $4.\n\nYou need to ensure that you consume at least 71 grams of protein, 141 grams of carbohydrates, and 1839 calories from the food combination you choose. The challenge is to determine the least expensive way to meet these nutritional requirements using these four food options. What is the least amount of money you can spend to meet your nutritional needs? Note that your response should only include the optimal cost value.",
    "ground_truth": 47.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Diet Problem",
        "modeling_type": "LP",
        "industry_sector": "Health",
        "reason": "The problem involves selecting quantities of different food items to meet minimum nutritional requirements at the lowest cost, which is a classic diet problem. Since fractional quantities of food items are implicitly allowed (not restricted to integers), it can be formulated as a Linear Program."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E043",
    "description": "Consider a scenario where a tour guide is planning a bus tour across five cities, named E, F, G, H, and I. The tour must start and end in the same city, and each city should be visited exactly once. The objective is to minimize the total cost of the tour, which could be influenced by factors such as distance, tolls, and fuel expenses.\n\nHere are the travel costs between the cities:\n\nFrom City E, it costs 37 units to travel to F, 72 units to G, 66 units to H, and 33 units to I.\nTravelling from City F, the costs are 37 units to E, 26 units to G, 56 units to H, and a whopping 100 units to I.\nIf the journey starts from City G, it takes 72 units to reach E, 26 units to F, 49 units to H, and 32 units to I.\nFrom City H, it costs 66 units to get to E, 56 units to F, 49 units to G, and a mere 13 units to I.\nLastly, from City I, the travel costs are 33 units to E, 100 units to F, 32 units to G, and 13 units to H.\n\nKeeping these costs in mind, what is the minimum total travel cost for the tour guide to take the bus to each city exactly once and return to the starting city?",
    "ground_truth": 158.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Routing",
        "modeling_type": "IP",
        "industry_sector": "Transportation",
        "reason": "The problem describes finding the minimum cost tour visiting each city exactly once and returning to the start, which is a classic Traveling Salesperson Problem (TSP), a type of routing problem. Given the discrete nature of city visits and fixed costs, an Integer Programming (IP) formulation is suitable. The application is clearly related to planning a bus tour, placing it in the transportation sector."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E061",
    "description": "Imagine a futuristic transportation network connecting 9 bustling sectors of a newly established colony on Mars, where each sector specializes in different aspects of Martian life, from agriculture to tech development. The network is designed to transport vital resources, such as water, food, and technology, from the colony's central supply hub (Sector 0) to its farthest outpost (Sector 8). The sectors are interconnected through a series of high-speed transport tubes, each with a specific capacity for carrying resources per Martian day.\n\nThe capacity for resource flow from one sector to another is as follows:\n\n- From Sector 0 (Central Supply Hub): Can send resources to Sector 1 (7 units), Sector 2 (4 units), Sector 3 (17 units), Sector 4 (4 units), Sector 5 (18 units), Sector 6 (17 units), Sector 7 (5 units), and Sector 8 (14 units).\n- From Sector 1: Can send resources to Sector 0 (2 units), Sector 2 (11 units), Sector 3 (10 units), Sector 4 (1 unit), Sector 5 (19 units), Sector 6 (6 units), Sector 7 (16 units), and Sector 8 (13 units).\n- From Sector 2: Can send resources to Sector 0 (8 units), Sector 1 (15 units), Sector 3 (5 units), Sector 4 (1 unit), Sector 5 (5 units), Sector 6 (11 units), Sector 7 (17 units), and Sector 8 (18 units).\n- From Sector 3: Can send resources to Sector 0 (2 units), Sector 1 (5 units), Sector 4 (6 units), Sector 5 (17 units), Sector 6 (1 unit), Sector 7 (16 units), and Sector 8 (14 units).\n- From Sector 4: Can send resources to Sector 0 (15 units), Sector 1 (6 units), Sector 2 (20 units), Sector 3 (15 units), Sector 5 (7 units), Sector 6 (13 units), Sector 7 (6 units), and Sector 8 (19 units).\n- From Sector 5: Can send resources to Sector 0 (15 units), Sector 1 (2 units), Sector 2 (8 units), Sector 3 (2 units), Sector 4 (3 units), Sector 6 (2 units), Sector 7 (9 units), and Sector 8 (2 units).\n- From Sector 6: Can send resources to Sector 0 (10 units), Sector 1 (12 units), Sector 2 (11 units), Sector 3 (10 units), Sector 4 (19 units), Sector 5 (9 units), Sector 7 (17 units), and Sector 8 (1 unit).\n- From Sector 7: Can send resources to Sector 0 (0 units), Sector 1 (20 units), Sector 2 (15 units), Sector 3 (19 units), Sector 4 (20 units), Sector 5 (18 units), Sector 6 (14 units), and Sector 8 (8 units).\n- From Sector 8 (Farthest Outpost): Can send resources back to Sector 0 (16 units), Sector 1 (13 units), Sector 2 (3 units), Sector 3 (3 units), Sector 4 (20 units), Sector 5 (19 units), Sector 6 (2 units), and Sector 7 (7 units).\n\nIn this Martian colony, a capacity of \"0\" means there is no direct transport tube connection between those two sectors.\n\nYour task is to calculate the maximum amount of resources that can be transported from the Central Supply Hub (Sector 0) to the Farthest Outpost (Sector 8) per Martian day, ensuring that the flow through each transport tube does not exceed its specified capacity. What is the maximum amount of resources that can be sent from the Central Supply Hub to the Farthest Outpost in units per Martian day?",
    "ground_truth": 86.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Network Flow",
        "modeling_type": "LP",
        "industry_sector": "Transportation",
        "reason": "The task describes a transportation network with capacities between nodes (sectors) and asks for the maximum amount of resources that can be sent from a source (Sector 0) to a sink (Sector 8), which is a classic maximum flow problem. This problem can be formulated as a Linear Program (LP)."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E023",
    "description": "Imagine you're trying to balance your nutritional intake and budget for the week. You have an array of eight different food items to choose from: Chicken, Rice, Eggs, Beans, Spinach, Corn, Beef, and Broccoli. These foods each offer different levels of protein, carbohydrates, and calories and come with various price tags. \n\nHere's the nutritional breakdown and cost of each food item:\n\n- Chicken: Provides 5 grams of protein, 15 grams of carbohydrates, and 162 calories at a cost of $8.\n- Rice: Supplies 8 grams of protein, 17 grams of carbohydrates, and 282 calories for $4.\n- Eggs: Deliver a solid 18 grams of protein, 20 grams of carbohydrates, and 234 calories for just $1.\n- Beans: Offer 16 grams of protein, 15 grams of carbohydrates, and 85 calories for $4.\n- Spinach: Adds 3 grams of protein, 28 grams of carbohydrates, and 194 calories for $7.\n- Corn: Gives 3 grams of protein, 19 grams of carbohydrates, and 153 calories for a modest $2.\n- Beef: Brings in 6 grams of protein, 24 grams of carbohydrates, and 167 calories for $9.\n- Broccoli: Offers 17 grams of protein, 9 grams of carbohydrates, and 192 calories for just $3.\n\nYour dietary goal for the week is to consume at least 68 grams of protein, 189 grams of carbohydrates, and 1840 calories. What is the least amount of money you need to spend to meet these nutritional requirements by choosing from these eight food items?",
    "ground_truth": 10.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Blending",
        "modeling_type": "LP",
        "industry_sector": "Health",
        "reason": "The problem involves selecting quantities of different food items to meet minimum nutritional requirements at the lowest cost, which is a classic blending problem. Since all relationships are linear and decision variables can be continuous (e.g., fractional servings), it can be formulated as a Linear Program. The application directly relates to dietary planning and nutritional intake, placing it in the health sector."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E064",
    "description": "In the heart of a bustling metropolis, there lies an intricate network of digital information pipelines connecting 8 crucial data centers. These centers, from the main server hub to the final relay station, are vital for processing and distributing vast amounts of data across the city. The connections between these data centers have specific bandwidth capacities that dictate the maximum flow of data (measured in terabytes per hour) that can be transmitted from one center to another.\n\nHere's a breakdown of the network's layout and its capacities:\n\n- From Data Center 0 (Source): Data can be sent to Center 1 (6 TB/h), Center 2 (16 TB/h), Center 3 (5 TB/h), Center 4 (6 TB/h), Center 5 (11 TB/h), Center 6 (6 TB/h), and Center 7 (4 TB/h).\n- From Data Center 1: Data can be transmitted to Center 2 (8 TB/h), Center 3 (10 TB/h), Center 4 (6 TB/h), Center 5 (3 TB/h), Center 6 (6 TB/h), and Center 7 (14 TB/h).\n- From Data Center 2: Can send data to Center 1 (6 TB/h), Center 3 (20 TB/h), Center 4 (7 TB/h), Center 5 (16 TB/h), Center 6 (13 TB/h), and Center 7 (14 TB/h).\n- From Data Center 3: Has capacities to Center 1 (11 TB/h), Center 2 (19 TB/h), Center 4 (18 TB/h), Center 5 (5 TB/h), and Center 7 (8 TB/h).\n- From Data Center 4: Can route data to Center 1 (1 TB/h), Center 2 (14 TB/h), Center 3 (18 TB/h), Center 5 (12 TB/h), Center 6 (4 TB/h), and Center 7 (7 TB/h).\n- From Data Center 5: Can dispatch data to Center 1 (16 TB/h), Center 2 (3 TB/h), Center 3 (20 TB/h), Center 4 (7 TB/h), Center 6 (15 TB/h), and Center 7 (6 TB/h).\n- From Data Center 6: Capable of sending to Center 1 (11 TB/h), Center 2 (4 TB/h), Center 3 (19 TB/h), Center 4 (7 TB/h), Center 5 (6 TB/h), and Center 7 (17 TB/h).\n- From Data Center 7 (Destination): Can receive return data flow from Center 1 (5 TB/h), Center 2 (8 TB/h), Center 3 (17 TB/h), Center 4 (2 TB/h), Center 5 (5 TB/h), and Center 6 (4 TB/h).\n\nIn this network, a capacity of \"0\" signifies an absence of direct data transmission capability between any two given data centers.\n\nThe challenge is to determine the maximum amount of data that can be efficiently transmitted from Data Center 0 (the main server hub) to Data Center 7 (the final relay station) per hour, without exceeding the bandwidth capacities of the connections between the centers. What is the optimal value of data flow (in terabytes per hour) that can be achieved from the source to the destination?",
    "ground_truth": 54.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Network Flow",
        "modeling_type": "LP",
        "industry_sector": "Telecommunications",
        "reason": "The problem asks to find the maximum amount of data that can be transmitted from a source to a destination through a network with capacity constraints, which is a classic maximum flow problem. This can be formulated as a Linear Program (LP)."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E029",
    "description": "Imagine you are on a mission to ensure you're eating healthily but also on a tight budget. You have five different food items to choose from: Chicken, Rice, Beans, Broccoli, and Fruit. Each of these foods has a specific amount of protein, carbohydrates, and calories, and each comes with its own cost.\n\nHere's an overview of what each food provides, along with its cost:\n\n- Chicken: Gives you 12 grams of protein, 2 grams of carbohydrates, and 186 calories for $6.\n- Rice: Provides 12 grams of protein, 24 grams of carbohydrates, and 250 calories for $6.\n- Beans: Offers 19 grams of protein, 18 grams of carbohydrates, and 134 calories for $6.\n- Broccoli: Supplies 19 grams of protein, 7 grams of carbohydrates, and 84 calories for $7.\n- Fruit: Gives you 4 grams of protein, a high 27 grams of carbohydrates, and 104 calories for $9.\n\nYour goal is to make sure you get at least 97 grams of protein, 163 grams of carbohydrates, and 2217 calories from the combination of these foods that you choose. Remember, you’re trying to figure out the least expensive way to meet these nutritional goals with these five food options. \n\nSo, what is the minimal cost you need to spend to satisfy all these dietary requirements?",
    "ground_truth": 54.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Blending",
        "modeling_type": "LP",
        "industry_sector": "Health",
        "reason": "The problem involves selecting quantities of different food items to meet minimum nutritional requirements at the lowest possible cost, which is a classic blending problem. Since the decision variables (quantities of food) can be continuous and the objective and constraints are linear, it can be formulated as a Linear Program. The application is directly related to dietary planning and nutrition, falling under the health sector."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E094",
    "description": "SupplyCo is presented with a strategic conundrum to optimize its distribution network. They need to supply their four retail outlets from potential distribution centers. Each center has its own operating cost and supply capacity. Transportation costs from each center to the respective retail outlets also need to be factored in. SupplyCo's objective is to satisfy the demand at each retail outlet at the minimum possible total cost.\n\nHere are the case specifics:\n\n- Number of Potential Distribution Centers: 4\n- Number of Retail Outlets: 4\n\nThe opening costs for each center are as follows (in dollars):\n\n- Center 1: $151,000\n- Center 2: $192,000\n- Center 3: $114,000\n- Center 4: $171,000\n\nThe transportation cost per unit from each distribution center to the outlets (in dollars) is as follows:\n\n- From Center 1: $5 to Outlet 1, $5 to Outlet 2, $2 to Outlet 3, $3 to Outlet 4\n- From Center 2: $3 to Outlet 1, $3 to Outlet 2, $5 to Outlet 3, $4 to Outlet 4\n- From Center 3: $3 to Outlet 1, $5 to Outlet 2, $2 to Outlet 3, $4 to Outlet 4\n- From Center 4: $2 to Outlet 1, $4 to Outlet 2, $5 to Outlet 3, $1 to Outlet 4\n\nThe demand at each retail outlet (in units) is:\n\n- Outlet 1: 859 units\n- Outlet 2: 713 units\n- Outlet 3: 421 units\n- Outlet 4: 652 units\n\nThe supply capacity of each distribution center (in units) is:\n\n- Center 1: 1547 units\n- Center 2: 1656 units\n- Center 3: 1274 units\n- Center 4: 1882 units\n\nQuestion:\nWhat is the optimal total cost for SupplyCo to open the distribution centers and transport goods to meet all retail outlets' demands, considering both the opening costs of the centers and the transportation costs for the goods?",
    "ground_truth": 273940.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Facility Location",
        "modeling_type": "MILP",
        "industry_sector": "Retail",
        "reason": "The problem involves deciding which distribution centers to open (a facility location decision) and then how to allocate supply to meet demand, minimizing total costs. The presence of fixed opening costs for centers and continuous transportation costs, along with binary decisions for opening centers, points to a Mixed-Integer Linear Programming formulation. The application is clearly within the retail sector, optimizing its supply chain network."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E013",
    "description": "Imagine you're a nutrition-conscious shopper who is trying to meet specific dietary requirements without breaking the bank. You have eight food items to choose from: Eggs, Grains, Berries, Nuts, Salmon, Vegetables, Rice, and Meat. Each of these foods has its own nutritional content and cost.\n\nLet's break down the nutritional content and cost of each food item:\n\n- Eggs: For $4, you get 2 grams of protein, 4 grams of carbohydrates, and 282 calories.\n- Grains: For $3, you get 7 grams of protein, 9 grams of carbohydrates, and 104 calories.\n- Berries: For $2, you get 6 grams of protein, 18 grams of carbohydrates, and 71 calories.\n- Nuts: For $4, you get 16 grams of protein, 3 grams of carbohydrates, and 116 calories.\n- Salmon: For $9, you get 20 grams of protein, 11 grams of carbohydrates, and 175 calories.\n- Vegetables: For $3, you get 6 grams of protein, 27 grams of carbohydrates, and 132 calories.\n- Rice: For $6, you get 6 grams of protein, 30 grams of carbohydrates, and 251 calories.\n- Meat: For $6, you get 5 grams of protein, 1 gram of carbohydrates, and 74 calories.\n\nYour goal is to get at least 84 grams of protein, 195 grams of carbohydrates, and 1941 calories within a day from a combination of these food items. The challenge here is to figure out the least expensive way to meet these nutritional targets with the given food options. So, what is the minimum cost you need to spend to meet your daily nutritional requirements? Keep in mind, the answer should be the optimal value under the scenario of food selection.",
    "ground_truth": 40.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Resource Allocation",
        "modeling_type": "LP",
        "industry_sector": "Health",
        "reason": "The problem involves allocating food items (resources) to meet nutritional targets (requirements) at minimum cost, which is a classic resource allocation problem. Since the decision variables (quantity of each food item) can be continuous and all relationships are linear, it can be formulated as a Linear Program."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E002",
    "description": "Imagine you're meticulously planning your weekly meals to ensure you're hitting all your nutritional goals while sticking to a budget. You're considering five diverse food items, each with unique nutritional benefits and costs. \n\nHere's a breakdown of what each food offers and its cost:\n\n- Food_1: Delivers 3 grams of protein, 16 grams of carbohydrates, and 96 calories for $9.\n- Food_2: Provides 17 grams of protein, 24 grams of carbohydrates, and 182 calories for $9.\n- Food_3: Offers 16 grams of protein, 27 grams of carbohydrates, and 114 calories for just $2.\n- Food_4: Contains 8 grams of protein, 16 grams of carbohydrates, and 208 calories for $9.\n- Food_5: Supplies 6 grams of protein, 6 grams of carbohydrates, and 236 calories for $5.\n\nYour dietary targets for the week are to consume at least 100 grams of protein, 180 grams of carbohydrates, and 1796 calories. Your challenge is to determine the most cost-effective combination of these food items to meet or exceed these nutritional requirements. What is the cheapest cost to achieve your dietary goals?",
    "ground_truth": 32.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Diet Problem",
        "modeling_type": "LP",
        "industry_sector": "Health",
        "reason": "The problem involves selecting quantities of different food items to meet minimum nutritional requirements at the lowest cost, which is a classic Diet Problem. Since the decision variables (quantities of food) can be continuous and the objective and constraints are linear, it can be formulated as a Linear Program (LP). The application is directly related to personal nutrition and well-being, fitting into the 'Health' sector."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E072",
    "description": "Imagine a network of highways that connect six major cities in a country. These highways are designed to facilitate the transportation of goods from a central warehouse (City 0) to a main retail hub (City 5). Each highway has a specific transportation capacity, indicating the maximum number of trucks it can accommodate per hour.\n\nHere is the transportation capacity of each highway connecting the cities:\n\n- From City 0 (Warehouse): Can send goods to City 1 (14 trucks), City 2 (15 trucks), City 3 (13 trucks), and City 5 (4 trucks).\n- From City 1: Can send goods to City 0 (10 trucks), City 2 (7 trucks), City 3 (18 trucks), City 4 (9 trucks), and City 5 (5 trucks).\n- From City 2: Can send goods to City 0 (11 trucks), City 3 (7 trucks), City 4 (13 trucks), and City 5 (6 trucks).\n- From City 3: Can send goods to City 0 (7 trucks), City 1 (11 trucks), City 2 (18 trucks), City 4 (17 trucks), and City 5 (2 trucks).\n- From City 4: Can send goods to City 0 (19 trucks), City 1 (8 trucks), City 2 (15 trucks), City 3 (15 trucks), and City 5 (5 trucks).\n- From City 5 (Retail Hub): Can send goods back to City 0 (10 trucks), City 1 (19 trucks), City 2 (17 trucks), City 3 (2 trucks), and City 4 (3 trucks).\n\nA capacity of \"0\" indicates that there is no direct highway link between those two cities.\n\nNow, consider a situation where you're tasked with finding the maximum number of trucks that can be dispatched from the warehouse in City 0 to the retail hub in City 5 per hour, without exceeding the transportation capacity of any highway. \n\nWhat is the maximum number of trucks that can be dispatched from the warehouse to the retail hub per hour, while maintaining the transportation capacity of each highway?",
    "ground_truth": 22.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Network Flow",
        "modeling_type": "LP",
        "industry_sector": "Transportation",
        "reason": "The problem involves finding the maximum flow of trucks from a source (warehouse) to a sink (retail hub) through a network of highways with given capacities, which is a classic maximum flow problem. This can be formulated as a Linear Program."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E105",
    "description": "A company produces two kinds of products. A product of the first type requires 1/4 hours of assembly labor, 1/8 hours of testing, and $1.2 worth of raw materials. A product of the second type requires 1/3 hours of assembly, 1/3 hours of testing, and $0.9 worth of raw materials. Given the current personnel of the company, there can be at most 90 hours of assembly labor and 80 hours of testing each day. Suppose that up to 50 hours of overtime assembly labor can be scheduled, at a cost of $9 per hour. Products of the first and second type have a market value of $9 and $8 respectively. Try to maximize the daily profit of the company. Provide your answer rounded to the nearest dollar.",
    "ground_truth": 3918.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Production Planning",
        "modeling_type": "LP",
        "industry_sector": "Manufacturing",
        "reason": "The problem involves determining optimal production quantities for two products to maximize profit, subject to resource constraints (labor, testing, raw materials), which is a classic production planning scenario. The relationships are linear (resource consumption, costs, revenues), and variables are continuous (hours, quantities), making it a Linear Programming problem. The context of producing goods with labor and materials clearly falls under the manufacturing sector."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E090",
    "description": "LogistiCorp is at a pivotal juncture, faced with the challenge of efficiently supplying nine retail stores from a pool of seven possible distribution centers. Each center presents a unique opening cost and has a specific capacity limit. Moreover, transporting goods from these centers to the retail stores incurs varying costs. The aim is to fulfill the demand at each retail store while minimizing the overall cost, which encompasses the opening expenses of the distribution centers and the transportation costs of the goods.\n\nGiven Data:\n- Number of Possible Distribution Centers: 7\n- Number of Retail Stores to be Supplied: 9\n\nOpening Costs for Each Distribution Center (in dollars):\n- Center 1: $151,000\n- Center 2: $192,000\n- Center 3: $114,000\n- Center 4: $171,000\n- Center 5: $160,000\n- Center 6: $120,000\n- Center 7: $182,000\n\nTransportation Cost Per Unit from Each Distribution Center to Retail Stores (in dollars):\n- From Center 1 to Stores: $3 to Store 1, $3 to Store 2, $5 to Store 3, $4 to Store 4, $3 to Store 5, $5 to Store 6, $2 to Store 7, $4 to Store 8, $2 to Store 9\n- From Center 2 to Stores: $4 to Store 1, $5 to Store 2, $1 to Store 3, $4 to Store 4, $2 to Store 5, $5 to Store 6, $4 to Store 7, $1 to Store 8, $1 to Store 9\n- From Center 3 to Stores: $3 to Store 1, $3 to Store 2, $2 to Store 3, $4 to Store 4, $4 to Store 5, $3 to Store 6, $4 to Store 7, $4 to Store 8, $1 to Store 9\n- From Center 4 to Stores: $3 to Store 1, $5 to Store 2, $3 to Store 3, $5 to Store 4, $1 to Store 5, $2 to Store 6, $4 to Store 7, $1 to Store 8, $4 to Store 9\n- From Center 5 to Stores: $2 to Store 1, $2 to Store 2, $1 to Store 3, $2 to Store 4, $5 to Store 5, $2 to Store 6, $4 to Store 7, $4 to Store 8, $4 to Store 9\n- From Center 6 to Stores: $4 to Store 1, $5 to Store 2, $3 to Store 3, $1 to Store 4, $4 to Store 5, $2 to Store 6, $4 to Store 7, $2 to Store 8, $2 to Store 9\n- From Center 7 to Stores: $4 to Store 1, $5 to Store 2, $2 to Store 3, $2 to Store 4, $4 to Store 5, $2 to Store 6, $2 to Store 7, $4 to Store 8, $4 to Store 9\n\nDemand of Each Retail Store (in units):\n- Store 1: 695 units\n- Store 2: 737 units\n- Store 3: 452 units\n- Store 4: 616 units\n- Store 5: 587 units\n- Store 6: 779 units\n- Store 7: 892 units\n- Store 8: 440 units\n- Store 9: 556 units\n\nSupply Capacity of Each Distribution Center (in units):\n- Center 1: 814 units\n- Center 2: 864 units\n- Center 3: 1,320 units\n- Center 4: 1,952 units\n- Center 5: 1,447 units\n- Center 6: 1,886 units\n- Center 7: 1,962 units\n\nQuestion:\nWhat is the optimal total cost for LogistiCorp to open distribution centers and transport goods to meet all retail stores' demands, including both the opening costs of the centers and the transportation costs of supplying the stores?",
    "ground_truth": 485771.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Facility Location",
        "modeling_type": "MILP",
        "industry_sector": "Logistics",
        "reason": "The problem involves deciding which distribution centers to open (a binary decision) and how much to transport from opened centers to retail stores to meet demand, minimizing total costs (fixed opening costs + variable transportation costs). This is a classic uncapacitated or capacitated facility location problem, which is typically formulated as a Mixed-Integer Linear Program."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E020",
    "description": "Imagine you're a dietitian crafting a meal plan for someone with specific nutritional goals. The challenge is not just to meet these nutritional needs but to do so in the most cost-effective way possible. The individual requires a precise amount of protein, carbohydrates, and calories each day, but the budget is tight, making it crucial to minimize the cost of the meal plan.\n\nYou have a list of eight food items to choose from, each with distinct nutritional content and associated cost:\n\n- Food_1: A modest source of protein and carbs with 1 gram of protein, 4 grams of carbohydrates, and 93 calories at a cost of $6.\n- Food_2: Rich in protein with 18 grams of protein, 2 grams of carbohydrates, and 219 calories, priced at $4.\n- Food_3: A balanced choice providing 19 grams of protein, 26 grams of carbs, and 155 calories for $4.\n- Food_4: High in protein with 19 grams of protein, 10 grams of carbs, and 105 calories, costing $3.\n- Food_5: Carb-heavy with 3 grams of protein, 24 grams of carbohydrates, and 255 calories at just $2.\n- Food_6: A good mix with 8 grams of protein, 26 grams of carbs, and 182 calories for $7.\n- Food_7: Impressive protein and carb content with 15 grams of protein, 27 grams of carbohydrates, and 173 calories, all for $3.\n- Food_8: Carb-rich with 3 grams of protein, 30 grams of carbohydrates, and 191 calories, also at $3.\n\nThe daily dietary requirements for the individual are:\n\n- Protein: At least 98 grams\n- Carbohydrates: At least 113 grams\n- Calories: At least 1768\n\nWith these food options and nutritional needs in mind, what is the minimum cost required to meet the daily protein, carbohydrate, and calorie requirements?",
    "ground_truth": 24.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Resource Allocation",
        "modeling_type": "LP",
        "industry_sector": "Health",
        "reason": "The problem involves allocating food items (resources) to meet nutritional requirements at minimum cost, which is a classic resource allocation problem. Since all relationships are linear (cost and nutritional content per unit of food) and decision variables can be continuous (e.g., fractional servings), it can be formulated as a Linear Program."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E049",
    "description": "Imagine a scenario involving a salesperson who needs to visit five distinct cities to promote their products. These cities are uniquely numbered from 1 to 5. The objective for the salesperson is to undertake a journey starting from any one of these cities and cover all others once before returning to the starting point, all while incurring the least travel cost possible. The travel costs vary depending on the route between each city pair.\n\nHere's a breakdown of the travel costs between the cities:\n- The cost to travel from City 1 to City 2 is 73 units, to City 3 is 39 units, to City 4 is 79 units, and to City 5 is 38 units.\n- From City 2, it costs 73 units to reach City 1, 30 units to go to City 3, 46 units to visit City 4, and 29 units to get to City 5.\n- Traveling from City 3, the costs are 39 units to City 1, 30 units to City 2, 88 units to City 4, and 57 units to City 5.\n- From City 4, it costs 79 units to go to City 1, 46 units to City 2, 88 units to City 3, and 59 units to City 5.\n- Lastly, from City 5, the travel costs are 38 units to City 1, 29 units to City 2, 57 units to City 3, and 59 units to City 4.\n\nGiven these details, what is the minimum total travel cost for the salesperson to visit each city exactly once and return to the starting city?",
    "ground_truth": 212.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Routing",
        "modeling_type": "IP",
        "industry_sector": "Transportation",
        "reason": "The problem describes a salesperson visiting multiple cities with the objective of minimizing travel cost, which is a classic Traveling Salesperson Problem (TSP), a type of routing problem. Since the decision variables (whether to travel between two cities) are binary and the objective is to minimize cost, it can be formulated as an Integer Program (IP). The context of a salesperson traveling between cities directly relates to the transportation sector."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E102",
    "description": "There are four nodes connected by directed edges. Node 1, which could represent the starting point, is connected to two other nodes: There is an edge from node 1 to node 2 with a capacity of 5. There is an edge from node 1 to node 3 with a capacity of 7. Node 2 is situated at the top of the graph and acts as an intermediate node, with three edges connected to it: An edge leading from node 2 to node 3 with a capacity of 2. An edge leading from node 2 to node 4 with a capacity of 4. Node 3 is another intermediate node and has two edges: An edge from node 3 to node 4 with a substantial capacity of 12. Node 4, which could represent the target or terminal, does not have any edges leading to other nodes, implying that it could be the end point. Find the corresponding maximum flow of the graph. Provide your answer rounded to the nearest integar.",
    "ground_truth": 12.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Network Flow",
        "modeling_type": "LP",
        "industry_sector": "General Optimization",
        "reason": "The problem explicitly asks for the 'maximum flow of the graph' given nodes and directed edges with capacities, which is a classic Network Flow problem. This can be formulated as a Linear Program (LP) where the objective is to maximize flow subject to capacity and flow conservation constraints. The problem is a fundamental graph theory problem without a specific industry context, hence 'General Optimization'."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E018",
    "description": "Picture this: you're trying to plan your meals for the day and you're aiming to get the right amount of nutrients, but also want to keep your expenses low. You have four different food options to choose from: Chicken, Cheese, Rice, and Beans. Each of these foods has a certain amount of protein, carbs, and calories, and each comes with its own price.\n\nHere's a brief overview of what each food provides and its cost:\n\n- Chicken: Gives you 16 grams of protein, 22 grams of carbohydrates, and 292 calories for $5.\n- Cheese: Offers 10 grams of protein, 4 grams of carbohydrates, and 82 calories for $9.\n- Rice: Provides 12 grams of protein, 21 grams of carbohydrates, and 207 calories for just $2.\n- Beans: Packs 13 grams of protein, 14 grams of carbohydrates, and 81 calories for a single dollar.\n\nYou need to ensure you consume at least 94 grams of protein, 191 grams of carbohydrates, and 2271 calories from the combination of these foods you choose. Your goal is to determine the most cost-effective way to reach these nutritional targets with these four food options. What is the minimum cost to meet your nutritional requirements?",
    "ground_truth": 22.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Diet Problem",
        "modeling_type": "LP",
        "industry_sector": "Health",
        "reason": "The problem involves selecting quantities of different food items to meet minimum nutritional requirements at the lowest possible cost, which is a classic Diet Problem. Since the decision variables (quantities of food) can be continuous and the objective and constraints are linear, it is formulated as a Linear Program. The application directly relates to personal nutrition and well-being, placing it in the Health sector."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E107",
    "description": "The China Railroad Ministry is in the process of planning relocations of freight cars among 5 regions of the country to get ready for the fall harvest. The following presents the costs of moving a car between each pair of regions. The costs are as follows: moving a car from region 1 to region 2 costs 10 units, to region 3 costs 12 units, to region 4 costs 17 units, and to region 5 costs 34 units. From region 2 to region 1 costs 10 units, to region 3 costs 18 units, to region 4 costs 8 units, and to region 5 costs 46 units. From region 3, moving a car to region 1 costs 12 units, to region 2 costs 18 units, to region 4 costs 9 units, and to region 5 costs 27 units. From region 4, the cost to move a car to region 1 is 17 units, to region 2 is 8 units, to region 3 is 9 units, and to region 5 is 20 units. Lastly, from region 5 to region 1 the cost is 34 units, to region 2 is 46 units, to region 3 is 27 units, and to region 4 is 20 units. The following displays the current number of cars and the number needed for harvest shipping in each region. Region 1 currently has 115 cars but needs 300. Region 2 has 385 cars available but requires 400. Region 3 has 410 cars against a need of 800. Region 4 is currently equipped with 480 cars, yet the need is only for 200. Finally, region 5 has 610 cars available, with a need for 300 cars. Minimize the cost to move the cars such as the need is met. Provide your answer rounded to the nearest dollar.",
    "ground_truth": 12170.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Network Flow",
        "modeling_type": "LP",
        "industry_sector": "Transportation",
        "reason": "The problem involves minimizing the cost of moving freight cars between different regions to satisfy demands, which is a classic minimum cost flow problem. The decision variables are continuous (number of cars to move), and the objective and constraints are linear, making it a Linear Program. The context of moving freight cars for a railroad ministry clearly places it in the transportation sector."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E091",
    "description": "BestWay Logistics is in the process of determining the best strategy to distribute products from its warehouses to four retail stores. The company has six potential distribution centers to choose from, each with its own costs associated with opening the center and transporting goods to the stores. Each center also has a specified maximum capacity it can handle. The aim is to satisfy the demand at each store at the lowest possible total cost, while taking into account the cost of opening the distribution centers and the transportation costs of the goods.\n\nThe details of the scenario are as follows:\n\nNumber of Potential Distribution Centers: 6\nNumber of Retail Stores Needing Supply: 4\n\nOpening Costs for Each Distribution Center (in dollars):\n- Center 1: 151,000\n- Center 2: 192,000\n- Center 3: 114,000\n- Center 4: 171,000\n- Center 5: 160,000\n- Center 6: 120,000\n\nTransportation Cost Per Unit from Each Distribution Center to Retail Stores (in dollars):\n- From Center 1: $2 to Store 1, $3 to Store 2, $3 to Store 3, $3 to Store 4\n- From Center 2: $5 to Store 1, $4 to Store 2, $3 to Store 3, $5 to Store 4\n- From Center 3: $2 to Store 1, $4 to Store 2, $2 to Store 3, $4 to Store 4\n- From Center 4: $5 to Store 1, $1 to Store 2, $4 to Store 3, $2 to Store 4\n- From Center 5: $5 to Store 1, $4 to Store 2, $1 to Store 3, $1 to Store 4\n- From Center 6: $3 to Store 1, $3 to Store 2, $2 to Store 3, $4 to Store 4\n\nDemand of Each Retail Store (in units):\n- Store 1: 589\n- Store 2: 962\n- Store 3: 966\n- Store 4: 643\n\nSupply Capacity of Each Distribution Center (in units):\n- Center 1: 1631\n- Center 2: 1954\n- Center 3: 1446\n- Center 4: 820\n- Center 5: 1640\n- Center 6: 966\n\nQuestion:\nWhat is the optimal total cost for BestWay Logistics to open the necessary distribution centers and transport goods to meet the demand of all retail stores? This cost should include both the opening costs of the centers and the transportation costs of supplying the stores. Please provide only the optimal value.",
    "ground_truth": 316282.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Facility Location",
        "modeling_type": "MILP",
        "industry_sector": "Logistics",
        "reason": "The problem involves deciding which distribution centers to open (a location decision) and how to allocate products from opened centers to stores, minimizing total costs. The decision variables for opening centers are binary, and transportation quantities are continuous, leading to a Mixed-Integer Linear Programming formulation."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E021",
    "description": "Imagine you're trying to put together a meal plan that ticks all the boxes: it meets all your nutritional needs and it doesn't break the bank. You're considering six different food items: Chicken, Rice, Eggs, Broccoli, Lentils, and Apples. Each of these foods provides different amounts of protein, carbohydrates, and calories, and they all come at different prices.\n\nHere's a rundown of what each food offers and how much it costs:\n\n- Chicken: It gives you 18 grams of protein, 5 grams of carbohydrates, and 202 calories for just $1.\n- Rice: With 14 grams of protein, 13 grams of carbs, and 234 calories, Rice is a bit pricier at $7.\n- Eggs: Like Chicken, Eggs also offer 18 grams of protein, along with 4 grams of carbs and 220 calories for $4.\n- Broccoli: A great source of protein at 7 grams, with 15 grams of carbs and 247 calories, this vegetable will cost you $3.\n- Lentils: They provide 15 grams of protein, 17 grams of carbs, and 88 calories for only $1.\n- Apples: They offer 8 grams of protein, 13 grams of carbohydrates, and 77 calories for $2.\n\nYou know that your meal plan needs to give you at least 70 grams of protein, 187 grams of carbohydrates, and 2181 calories. Your challenge is to determine the least expensive way to get all the nutrients you need from this group of six food items.\n\nSo, what is the minimum total cost you would need to spend to meet all your dietary requirements for the day?",
    "ground_truth": 16.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Blending",
        "modeling_type": "LP",
        "industry_sector": "Health",
        "reason": "The problem involves selecting quantities of different food items to meet minimum nutritional requirements at the lowest possible cost, which is a classic blending problem. Since all relationships are linear and variables can be continuous (e.g., fractions of food items), it can be formulated as a Linear Program. The application directly relates to dietary planning and nutrition, placing it in the health sector."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E068",
    "description": "In the heart of a bustling metropolis, there exists a complex network of tunnels designed to transport electricity from a central power plant to various substations across the city. This network is composed of 8 crucial nodes, each representing a key junction point in the electrical distribution system. The nodes range from the primary power plant, where electricity is generated, to a final distribution center, from which electricity is routed to meet the city's demands.\n\nThe capacity of each tunnel, measured in thousands of kilowatts per hour (kWh), dictates the maximum amount of electricity that can flow between any two nodes. The connections and their capacities are as follows:\n\n- From the Power Plant (Node 0): Electricity can be sent to Node 1 (2 kWh), Node 2 (1 kWh), Node 3 (1 kWh), Node 4 (8 kWh), Node 5 (17 kWh), Node 6 (6 kWh), and Node 7 (7 kWh).\n- From Node 1: Electricity can flow to the Power Plant (4 kWh), Node 2 (14 kWh), Node 3 (14 kWh), Node 4 (13 kWh), Node 5 (19 kWh), Node 6 (4 kWh), and Node 7 (19 kWh).\n- From Node 2: Electricity can be distributed to the Power Plant (6 kWh), Node 1 (16 kWh), Node 3 (3 kWh), Node 4 (10 kWh), Node 5 (7 kWh), Node 6 (18 kWh), and Node 7 (10 kWh).\n- From Node 3: Electricity can travel to the Power Plant (19 kWh), Node 1 (4 kWh), Node 2 (15 kWh), Node 4 (6 kWh), Node 5 (1 kWh), Node 6 (17 kWh), and Node 7 (9 kWh).\n- From Node 4: Electricity can be dispatched to the Power Plant (12 kWh), Node 1 (15 kWh), Node 2 (3 kWh), Node 3 (14 kWh), Node 5 (18 kWh), Node 6 (20 kWh), and Node 7 (14 kWh).\n- From Node 5: Electricity can move to the Power Plant (20 kWh), Node 1 (5 kWh), Node 2 (19 kWh), Node 3 (9 kWh), Node 4 (20 kWh), Node 6 (10 kWh), and Node 7 (6 kWh).\n- From Node 6: Electricity can be sent to the Power Plant (9 kWh), Node 1 (14 kWh), Node 2 (12 kWh), Node 3 (16 kWh), Node 4 (19 kWh), Node 5 (3 kWh), and Node 7 (10 kWh).\n- From Node 7 (Final Distribution Center): Electricity can return to the Power Plant (20 kWh), Node 1 (16 kWh), Node 2 (6 kWh), Node 3 (16 kWh), Node 4 (8 kWh), Node 5 (16 kWh), and Node 6 (4 kWh).\n\nIn this electrical network, a capacity of \"0\" indicates no direct tunnel connection for electricity flow between those two nodes.\n\nThe challenge is to compute the maximum amount of electricity that can be efficiently distributed from the Power Plant (Node 0) to the Final Distribution Center (Node 7) per hour, ensuring that the flow through each tunnel does not exceed its maximum capacity. What is the optimal value of electricity (in thousands of kilowatts per hour) that can be transported from the source to the sink in this network?",
    "ground_truth": 42.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Network Flow",
        "modeling_type": "LP",
        "industry_sector": "Energy",
        "reason": "The problem asks to find the maximum amount of electricity that can flow from a source (Power Plant) to a sink (Final Distribution Center) through a network with given capacities, which is a classic maximum flow problem. This problem can be formulated as a Linear Program (LP)."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E045",
    "description": "Imagine a scenario where a salesperson is tasked with visiting four distinct cities to explore new market opportunities. These cities are uniquely identified as City 1, City 2, City 3, and City 4. The task for the salesperson is to plan a route that starts from any of these cities, traverses each city exactly once, and concludes by returning to the starting city. The overarching aim is to achieve this while incurring the minimum possible travel cost.\n\nHere’s a detailed breakdown of the travel costs between the cities:\n- The cost to travel from City 1 to City 2 is 17 units, to City 3 is 25 units, and to City 4 is 31 units.\n- From City 2, it costs 17 units to reach City 1, 93 units to get to City 3, and 45 units to City 4.\n- Traveling from City 3, the expenses are 25 units to City 1, 93 units to City 2, and 95 units to City 4.\n- Lastly, from City 4, the journey costs 31 units to City 1, 45 units to City 2, and 95 units to City 3.\n\nWhat is the minimum total travel cost for the salesperson to visit each city exactly once and return to the starting city?",
    "ground_truth": 140.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Routing",
        "modeling_type": "IP",
        "industry_sector": "Transportation",
        "reason": "The problem describes a salesperson visiting multiple cities and returning to the start, aiming to minimize travel cost, which is a classic Traveling Salesperson Problem (TSP) falling under Routing. Given the discrete nature of city visits and the objective to find an optimal path, an Integer Program (IP) is the standard modeling approach. The context of a salesperson traveling between cities directly relates to the Transportation sector."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E019",
    "description": "Imagine you're planning your meals for the week and you want to keep everything balanced: enough nutrients for a healthy lifestyle but also manageable costs. You have six food options to consider: Chicken, Rice, Vegetables, Bread, Almonds, and Salmon. Each of these foods has its own nutritional content in terms of proteins, carbs, and calories, and also its own cost.\n\nHere's a summary of what each food offers and its cost:\n\n- Chicken: Offers 16 grams of protein, 8 grams of carbohydrates, and 50 calories for $2.\n- Rice: Provides 11 grams of protein, 24 grams of carbohydrates, and 90 calories for $3.\n- Vegetables: Gives you 1 gram of protein, 5 grams of carbohydrates, and a hefty 164 calories for $3.\n- Bread: Packs in 6 grams of protein, 26 grams of carbohydrates, and 165 calories for $2.\n- Almonds: Offer 2 grams of protein, 11 grams of carbohydrates, and 51 calories for $4.\n- Salmon: Packs in a big punch with 19 grams of protein, 20 grams of carbohydrates, and provides 238 calories for $10.\n\nYou aim to hit at least 58 grams of protein, 150 grams of carbohydrates, and 2392 calories from whichever combination of these foods you choose. Your challenge is to determine the most affordable way to meet these nutritional targets with the six food options at your disposal. What is the minimum cost to satisfy all your nutritional needs for the week? Remember, your answer should indicate only the optimal cost value.",
    "ground_truth": 30.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Blending",
        "modeling_type": "LP",
        "industry_sector": "Health",
        "reason": "The problem involves determining the optimal mix of food items to meet nutritional requirements at minimum cost, which is a classic blending problem. Since the decision variables (quantities of food) can be continuous and all relationships are linear, it can be formulated as a Linear Program. The application directly relates to dietary planning and nutritional intake, placing it in the health sector."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E011",
    "description": "Imagine you're a dietitian tasked with planning a daily meal for a client with specific dietary goals. Your challenge is to select from four available food options to meet the nutritional requirements at the minimal cost. Each food item has its distinct protein, carbohydrate, and caloric content along with a price tag.\n\nHere’s a quick overview of the food items and their respective nutritional values and costs:\n\n- Food_1: Contains 2 grams of protein, 9 grams of carbohydrates, and 165 calories, all for $3.\n- Food_2: Provides 11 grams of protein, 29 grams of carbohydrates, and 230 calories for $3.\n- Food_3: Offers 19 grams of protein, 16 grams of carbohydrates, and 68 calories for $6.\n- Food_4: Delivers 17 grams of protein, 9 grams of carbohydrates, and 258 calories for $9.\n\nThe nutritional targets set for your client are to consume at least 88 grams of protein, 107 grams of carbohydrates, and 1944 calories in a day. Your goal is to determine the least expensive way to meet these dietary requirements using the available food options. What is the cheapest cost to achieve these nutritional goals?",
    "ground_truth": 27.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Diet Problem",
        "modeling_type": "LP",
        "industry_sector": "Health",
        "reason": "The problem involves selecting food items to meet nutritional requirements at minimum cost, which is a classic Diet Problem. Since the decision variables (quantities of food) can be continuous and the objective and constraints are linear, it is an LP. The application is directly related to health and nutrition planning."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E082",
    "description": "GlobalSupply Inc. is at a crucial juncture in streamlining its logistics to efficiently service six retail outlets spread across different locations. The company has narrowed down its options to four possible distribution centers, each with unique characteristics, including varying operational costs and different capacities for handling supply. Moreover, the cost to transport goods from these centers to each retail outlet is not uniform, adding layers of complexity to the decision-making process. The overarching goal for GlobalSupply Inc. is to ensure that the demands of all retail stores are met at the lowest possible total cost, incorporating both the opening expenses for these distribution centers and the costs associated with transporting goods to the stores.\n\nGiven Data:\n- Number of Potential Distribution Centers: 4\n- Number of Retail Stores to be Supplied: 6\n\nOpening Costs for Each Distribution Center (in dollars):\n- Center 1: $151,000\n- Center 2: $192,000\n- Center 3: $114,000\n- Center 4: $171,000\n\nTransportation Cost Per Unit from Each Distribution Center to Retail Stores (in dollars):\n- From Center 1: $5 to Store 1, $5 to Store 2, $2 to Store 3, $3 to Store 4, $3 to Store 5, $3 to Store 6\n- From Center 2: $5 to Store 1, $4 to Store 2, $3 to Store 3, $5 to Store 4, $2 to Store 5, $4 to Store 6\n- From Center 3: $2 to Store 1, $4 to Store 2, $5 to Store 3, $1 to Store 4, $4 to Store 5, $2 to Store 6\n- From Center 4: $5 to Store 1, $4 to Store 2, $1 to Store 3, $1 to Store 4, $3 to Store 5, $3 to Store 6\n\nDemand of Each Retail Store (in units):\n- Store 1: 910 units\n- Store 2: 875 units\n- Store 3: 589 units\n- Store 4: 962 units\n- Store 5: 966 units\n- Store 6: 643 units\n\nSupply Capacity of Each Distribution Center (in units):\n- Center 1: 1631 units\n- Center 2: 1954 units\n- Center 3: 1446 units\n- Center 4: 820 units\n\nQuestion:\nWhat is the optimal total cost for GlobalSupply Inc. to open the necessary distribution centers and transport goods in such a way that all retail stores' demands are fulfilled? This total should encompass both the operational opening costs and the logistical costs of supply to the outlets.",
    "ground_truth": 469200.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Facility Location",
        "modeling_type": "MILP",
        "industry_sector": "Retail",
        "reason": "The problem involves deciding which distribution centers to open (a binary decision) and how to allocate supply from open centers to retail stores to meet demand at minimum total cost, which is a classic facility location problem. The presence of both continuous (transportation quantities) and binary (center opening) variables, along with linear objective and constraints, indicates a Mixed-Integer Linear Programming (MILP) formulation. The application is clearly within the retail sector, as it deals with supplying retail outlets from distribution centers."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E003",
    "description": "Imagine you are tasked with planning a nutritious and cost-effective meal plan for the day, ensuring that you meet specific nutritional targets. You have a selection of six different food items, each with unique nutritional values and costs. Your goal is to meet the daily dietary requirements for protein, carbohydrates, and calories without overspending.\n\nHere's a breakdown of the food items available:\n\n- Food_1: Costs $4, provides 17 grams of protein, 8 grams of carbohydrates, and 237 calories.\n- Food_2: Costs $2, provides 4 grams of protein, 24 grams of carbohydrates, and 213 calories.\n- Food_3: Costs $6, provides 7 grams of protein, 27 grams of carbohydrates, and 133 calories.\n- Food_4: Costs $2, provides 14 grams of protein, 16 grams of carbohydrates, and 118 calories.\n- Food_5: Costs $6, provides 13 grams of protein, 1 gram of carbohydrates, and 136 calories.\n- Food_6: Costs $8, provides 1 gram of protein, 13 grams of carbohydrates, and 225 calories.\n\nThe dietary requirements you need to meet are at least 76 grams of protein, 173 grams of carbohydrates, and 1751 calories for the day.\n\nWhat is the minimum cost required to meet these nutritional needs using any combination of these food items?",
    "ground_truth": 22.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Blending",
        "modeling_type": "LP",
        "industry_sector": "Health",
        "reason": "The problem involves selecting a mix of food items to meet nutritional requirements at minimum cost, which is a classic blending problem. Since the decision variables (quantities of food items) can be continuous and all relationships are linear, it can be formulated as a Linear Program. The application is directly related to dietary planning and nutrition, falling under the health sector."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E017",
    "description": "Suppose you are a student on a budget, trying to balance the need for good nutrition with your financial constraints. You have identified four different food items that you could include in your meals: Eggs, Rice, Chicken, and Broccoli. Each of these items provides different amounts of protein, carbohydrates, and calories, and also has a different cost.\n\nHere's a rundown of what each food item offers and its cost:\n\n- Eggs: For a cost of $6, you get 4 grams of protein, 13 grams of carbohydrates, and 238 calories.\n- Rice: For $10, you can get 1 gram of protein, 13 grams of carbohydrates, and 85 calories.\n- Chicken: A true bargain at only $1, it offers 10 grams of protein, 29 grams of carbohydrates, and 146 calories.\n- Broccoli: Costs $7 and provides 8 grams of protein, 26 grams of carbohydrates, and 139 calories.\n\nYour daily dietary goal is to consume at least 93 grams of protein, 165 grams of carbohydrates, and 1553 calories. Your ultimate goal is to work out the least expensive way to meet all these nutritional targets with the four food options you have. What is the cheapest cost to meet your nutrition requirements?",
    "ground_truth": 11.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Blending",
        "modeling_type": "LP",
        "industry_sector": "Health",
        "reason": "The problem involves determining the optimal mix of food items to meet nutritional requirements at minimum cost, which is a classic blending problem. Since the decision variables (quantities of food items) can be continuous and all relationships are linear, it can be formulated as a Linear Program."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E038",
    "description": "Imagine you're the logistics coordinator in charge of distributing medical supplies among four different hospitals during an unexpected health crisis. Each hospital starts with a specific number of supplies but has varying needs based on the urgency and scale of cases they are handling.\n\nHere's what each hospital has and what they need:\n\n- Hospital 1 has 480 units of supplies but needs only 61 units.\n- Hospital 2 has 492 units but needs 313 units.\n- Hospital 3 has 74 units but needs 93 units.\n- Hospital 4 has 317 units but needs 199 units.\n\nDue to the urgent situation, you can transfer supplies between hospitals, but each transfer incurs a cost, which varies depending on the hospitals involved. Here’s a breakdown of the cost to transfer supplies from one hospital to another:\n\n- Moving supplies from/to Hospital 1: To Hospital 2 costs 8, to Hospital 3 costs 42, to Hospital 4 costs 27.\n- Moving supplies from/to Hospital 2: To Hospital 1 costs 17, to Hospital 3 costs 13, to Hospital 4 costs 30.\n- Moving supplies from/to Hospital 3: To Hospital 1 costs 4, to Hospital 2 costs 14, to Hospital 4 costs 16.\n- Moving supplies from/to Hospital 4: To Hospital 1 costs 33, to Hospital 2 costs 9, to Hospital 3 costs 42.\n\nYour objective is to ensure each hospital has the supplies it needs while minimizing the total cost of transfers. What would be the minimum cost to achieve this?",
    "ground_truth": 247.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Network Flow",
        "modeling_type": "LP",
        "industry_sector": "Health",
        "reason": "The problem involves distributing medical supplies between hospitals with varying initial inventories and demands, minimizing transfer costs. This is a classic transportation problem, which is a special case of a minimum cost network flow problem. Since the quantities can be continuous and there are no integer restrictions mentioned, it can be modeled as a Linear Program."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E006",
    "description": "Imagine you're meticulously planning your weekly meal prep and want to ensure that your diet is nutritionally balanced while also being cost-effective. You have a choice between five different food items, each with its own nutritional profile and cost. Your challenge is to choose the right combination of these foods to meet your nutritional needs without overspending.\n\nHere's what each food item offers along with its cost:\n\n- Food_1: Provides 10 grams of protein, 22 grams of carbohydrates, and 80 calories for $2.\n- Food_2: Offers 3 grams of protein, 4 grams of carbohydrates, and 189 calories for $8.\n- Food_3: Contains 17 grams of protein, 10 grams of carbohydrates, and 153 calories for $4.\n- Food_4: Delivers 6 grams of protein, 13 grams of carbohydrates, and 232 calories for $1.\n- Food_5: Packs 20 grams of protein, 5 grams of carbohydrates, and 204 calories for $8.\n\nYour dietary goals are to consume at least 74 grams of protein, 102 grams of carbohydrates, and 1564 calories in total. What is the minimum cost required to meet these nutritional targets using any combination of the available food items?",
    "ground_truth": 13.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Diet Problem",
        "modeling_type": "LP",
        "industry_sector": "Health",
        "reason": "The problem involves selecting quantities of different food items to meet minimum nutritional requirements at a minimum cost, which is a classic diet problem. Since fractional quantities of food items are implicitly allowed and all relationships are linear, it can be formulated as a Linear Program."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E055",
    "description": "Welcome to the challenge of optimizing the digital traffic flow in CyberCity, a bustling metropolis of the future. In this city, data packets travel through a sophisticated network of 8 digital relay stations, from the primary source node to a key destination node, facilitating seamless communication across the city.\n\nThe network is structured as follows, with each connection representing the maximum data capacity (measured in terabits per second, Tbps) that can flow from one relay station to another:\n\n- From Relay Station 0 (Source): Data can flow to Station 1 (3 Tbps), Station 2 (3 Tbps), Station 3 (5 Tbps), Station 4 (13 Tbps), Station 5 (7 Tbps), Station 6 (14 Tbps), and Station 7 (17 Tbps).\n- From Relay Station 1: Data can flow to Station 0 (5 Tbps), Station 3 (2 Tbps), Station 4 (18 Tbps), Station 5 (20 Tbps), Station 6 (1 Tbps), and Station 7 (17 Tbps).\n- From Relay Station 2: Data can flow to Station 0 (2 Tbps), Station 1 (18 Tbps), Station 3 (10 Tbps), Station 4 (14 Tbps), Station 5 (15 Tbps), Station 6 (8 Tbps), and Station 7 (18 Tbps).\n- From Relay Station 3: Data can flow to Station 0 (20 Tbps), Station 1 (7 Tbps), Station 2 (11 Tbps), Station 4 (13 Tbps), Station 5 (2 Tbps), Station 6 (8 Tbps), and Station 7 (12 Tbps).\n- From Relay Station 4: Data can flow to Station 0 (20 Tbps), Station 1 (20 Tbps), Station 2 (12 Tbps), Station 3 (7 Tbps), Station 5 (11 Tbps), Station 6 (2 Tbps), and Station 7 (14 Tbps).\n- From Relay Station 5: Data can flow to Station 0 (5 Tbps), Station 1 (16 Tbps), Station 2 (15 Tbps), Station 3 (19 Tbps), Station 4 (11 Tbps), Station 6 (1 Tbps), and Station 7 (8 Tbps).\n- From Relay Station 6: Data can flow to Station 0 (10 Tbps), Station 1 (3 Tbps), Station 2 (14 Tbps), Station 3 (18 Tbps), Station 4 (13 Tbps), Station 5 (6 Tbps), and Station 7 (7 Tbps).\n- From Relay Station 7 (Destination): Data can loop back to Station 0 (9 Tbps), Station 1 (3 Tbps), Station 2 (14 Tbps), Station 3 (13 Tbps), Station 4 (6 Tbps), Station 5 (5 Tbps), and Station 6 (9 Tbps).\n\nIn this system, a capacity of \"0\" means there is no direct data link between those two stations. The objective of this problem is to find the maximum amount of data that can be transmitted from Station 0 (the source) to Station 7 (the destination) per second, while ensuring the data flow through each connection doesn't exceed its maximum capacity.\n\nWhat is the maximum data flow, in terabits per second, that can be achieved from the source to the destination in this network?",
    "ground_truth": 62.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Network Flow",
        "modeling_type": "LP",
        "industry_sector": "Telecommunications",
        "reason": "The problem asks to find the maximum amount of data that can be transmitted from a source to a destination through a network with capacity constraints on each connection, which is a classic maximum flow problem. This can be formulated as a Linear Program (LP)."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E041",
    "description": "Imagine a scenario where a salesperson needs to visit five different cities, identified as Cities 1 through 5, to present their products. The salesperson has the flexibility to choose any city as a starting point; however, they are required to visit each city exactly once and then return to the starting city. The primary goal is to complete this circuit while incurring the lowest possible travel cost.\n\nHere’s a summary of the travel costs between the cities:\n- The cost to travel from City 1 to City 2 is 28 units, to City 3 is 89 units, to City 4 is 59 units, and to City 5 is 41 units.\n- From City 2, it costs 28 units to reach City 1, 85 units to get to City 3, 12 units to City 4, and 68 units to City 5.\n- Traveling from City 3, the costs are 89 units to City 1, 85 units to City 2, 22 units to City 4, and 70 units to City 5.\n- From City 4, the journey costs 59 units to City 1, 12 units to City 2, 22 units to City 3, and 48 units to City 5.\n- Lastly, from City 5, it costs 41 units to travel to City 1, 68 units to City 2, 70 units to City 3, and 48 units to City 4.\n\nWhat is the minimum total travel cost for the salesperson to visit each of the five cities exactly once and return to the starting city?",
    "ground_truth": 173.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Routing",
        "modeling_type": "IP",
        "industry_sector": "Transportation",
        "reason": "The problem describes a salesperson visiting multiple cities, which is a classic Traveling Salesperson Problem (TSP), a fundamental problem in Routing. Since the decision variables (whether to travel between two cities) are binary and the objective is to minimize total cost, it can be formulated as an Integer Program. The context of a salesperson traveling between cities directly relates to the transportation sector."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E070",
    "description": "Welcome to the challenge of optimizing the network of a futuristic transportation system that interconnects 7 strategic hubs across a thriving metropolis. These hubs, ranging from the central dispatch center to the main distribution hub, are connected by a network of high-speed transit lanes, each with a distinct capacity limitation for vehicles per hour. \n\nHere's a breakdown of the transit system's capabilities, indicating the maximum number of vehicles that can move from one hub to another within an hour:\n\n- From Hub 0 (Central Dispatch): Vehicles can move to Hub 1 (15 vehicles), Hub 2 (2 vehicles), Hub 3 (16 vehicles), Hub 4 (3 vehicles), Hub 5 (5 vehicles), and Hub 6 (3 vehicles).\n- From Hub 1: Vehicles can move to Hub 0 (7 vehicles), Hub 4 (19 vehicles), Hub 5 (15 vehicles), and Hub 6 (16 vehicles).\n- From Hub 2: Vehicles can move to Hub 0 (11 vehicles), Hub 1 (14 vehicles), Hub 3 (14 vehicles), Hub 4 (8 vehicles), Hub 5 (11 vehicles), and Hub 6 (6 vehicles).\n- From Hub 3: Vehicles can move to Hub 0 (17 vehicles), Hub 1 (11 vehicles), Hub 2 (11 vehicles), Hub 4 (11 vehicles), Hub 5 (16 vehicles), and Hub 6 (19 vehicles).\n- From Hub 4: Vehicles can move to Hub 0 (10 vehicles), Hub 1 (4 vehicles), Hub 2 (17 vehicles), Hub 3 (20 vehicles), Hub 5 (12 vehicles), and Hub 6 (17 vehicles).\n- From Hub 5: Vehicles can move to Hub 0 (3 vehicles), Hub 2 (4 vehicles), Hub 3 (5 vehicles), Hub 4 (20 vehicles), and Hub 6 (4 vehicles).\n- From Hub 6 (Main Distribution Hub): Vehicles can move back to Hub 0 (15 vehicles), Hub 1 (2 vehicles), Hub 2 (15 vehicles), Hub 3 (18 vehicles), Hub 4 (17 vehicles), and Hub 5 (7 vehicles).\n\nIn this advanced transit network, a capacity of \"0\" indicates that there is no direct transit lane connecting two specific hubs.\n\nThe objective is to determine the maximum capacity of vehicles that can be dispatched from Hub 0 (the Central Dispatch Center) to Hub 6 (the Main Distribution Hub) per hour, while ensuring that the flow through each transit lane does not exceed its specified capacity limit. \n\nWhat is the maximum number of vehicles that can be optimally dispatched from the Central Dispatch Center to the Main Distribution Hub within an hour?",
    "ground_truth": 44.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Network Flow",
        "modeling_type": "LP",
        "industry_sector": "Transportation",
        "reason": "The problem describes a network of hubs and transit lanes with capacities, aiming to find the maximum flow from a source (Hub 0) to a sink (Hub 6). This is a classic maximum flow problem, which can be formulated as a Linear Program (LP)."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E059",
    "description": "Welcome to the virtual challenge of constructing a futuristic energy distribution network spanning across 8 pivotal nodes, designed to optimize the flow of a newly discovered renewable energy source from its origin to a central processing facility. This network, conceptualized within a high-tech cityscape, involves complex routes and capacities that dictate the maximum energy flow possible between nodes, each representing energy substations or relay points.\n\nHere’s a closer look at the energy flow capacities (in megawatts) between these substations:\n\n- From Substation 0 (Source): Energy can be directed to Substation 1 (19 MW), Substation 2 (4 MW), Substation 3 (1 MW), Substation 4 (9 MW), Substation 5 (13 MW), Substation 6 (8 MW), and Substation 7 (20 MW).\n- From Substation 1: Can relay energy to Substation 0 (10 MW), Substation 2 (12 MW), Substation 3 (12 MW), Substation 4 (8 MW), Substation 5 (12 MW), Substation 6 (7 MW), and Substation 7 (7 MW).\n- From Substation 2: Can transfer energy to Substation 0 (13 MW), Substation 1 (11 MW), Substation 3 (8 MW), Substation 4 (4 MW), Substation 5 (1 MW), Substation 6 (2 MW), and Substation 7 (3 MW).\n- From Substation 3: Can distribute energy to Substation 0 (4 MW), Substation 1 (12 MW), Substation 2 (13 MW), Substation 4 (18 MW), Substation 5 (6 MW), Substation 6 (19 MW), and Substation 7 (8 MW).\n- From Substation 4: Can send energy to Substation 0 (9 MW), Substation 1 (16 MW), Substation 2 (2 MW), Substation 5 (14 MW), Substation 6 (18 MW), and Substation 7 (7 MW).\n- From Substation 5: Can dispatch energy to Substation 0 (10 MW), Substation 1 (11 MW), Substation 2 (7 MW), Substation 3 (11 MW), Substation 4 (16 MW), Substation 6 (16 MW), and Substation 7 (5 MW).\n- From Substation 6: Capable of forwarding energy to Substation 0 (14 MW), Substation 1 (11 MW), Substation 2 (9 MW), Substation 3 (11 MW), Substation 4 (3 MW), Substation 5 (17 MW), and Substation 7 (19 MW).\n- From Substation 7 (Destination): Can receive energy and has the potential to send it back to Substation 0 (12 MW), Substation 1 (20 MW), Substation 2 (5 MW), Substation 3 (11 MW), Substation 4 (10 MW), Substation 5 (4 MW), and Substation 6 (6 MW).\n\nIn this setup, a capacity of \"0\" signifies the absence of a direct energy transfer link between the two respective substations.\n\nThe ultimate objective is to compute the maximum energy that can be transmitted from Substation 0 (the source) to Substation 7 (the destination) per time unit, with the condition that the energy flow through each link does not surpass its maximum capacity. What is the optimal value of energy (in megawatts) that can be efficiently relayed from the source to the destination per time unit?",
    "ground_truth": 69.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Network Flow",
        "modeling_type": "LP",
        "industry_sector": "Energy",
        "reason": "The problem explicitly asks to maximize the flow of energy through a network of substations with given capacities, which is a classic maximum flow problem. This can be formulated as a Linear Program (LP) where decision variables represent flow on each arc, subject to capacity and flow conservation constraints. The application is directly related to energy distribution."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E097",
    "description": "In the bustling market of Logistico, a strategic dilemma looms over the horizon for the newly-established retail giant, SupplyChainMax. With an expansive network of five retail stores to cater to, the company stands at the crossroads of selecting the most cost-effective distribution strategy from a pool of eight potential distribution centers. Each center not only comes with its unique price tag for opening but also a specific capacity limit and variable transportation costs to each store. The crux of SupplyChainMax's challenge lies in opening the right blend of distribution centers that would minimally cost them to meet the retail stores' demands, ensuring a smooth flow of goods at the lowest possible overall cost.\n\nGiven Data:\n- Number of Potential Distribution Centers: 8\n- Number of Retail Stores to be Supplied: 5\n\nOpening Costs for Each Distribution Center (in dollars):\n- Distribution Center 1: $151,000\n- Distribution Center 2: $192,000\n- Distribution Center 3: $114,000\n- Distribution Center 4: $171,000\n- Distribution Center 5: $160,000\n- Distribution Center 6: $120,000\n- Distribution Center 7: $182,000\n- Distribution Center 8: $186,000\n\nTransportation Cost Per Unit from Each Distribution Center to Retail Stores (in dollars):\n- From Distribution Center 1: $3 to Store 1, $3 to Store 2, $5 to Store 3, $4 to Store 4, $3 to Store 5\n- From Distribution Center 2: $5 to Store 1, $2 to Store 2, $4 to Store 3, $2 to Store 4, $4 to Store 5\n- From Distribution Center 3: $5 to Store 1, $1 to Store 2, $4 to Store 3, $2 to Store 4, $5 to Store 5\n- From Distribution Center 4: $4 to Store 1, $1 to Store 2, $1 to Store 3, $3 to Store 4, $3 to Store 5\n- From Distribution Center 5: $2 to Store 1, $4 to Store 2, $4 to Store 3, $3 to Store 4, $4 to Store 5\n- From Distribution Center 6: $4 to Store 1, $1 to Store 2, $3 to Store 3, $5 to Store 4, $3 to Store 5\n- From Distribution Center 7: $5 to Store 1, $1 to Store 2, $2 to Store 3, $4 to Store 4, $1 to Store 5\n- From Distribution Center 8: $4 to Store 1, $2 to Store 2, $2 to Store 3, $1 to Store 4, $2 to Store 5\n\nDemand of Each Retail Store (in units):\n- Store 1: 964 units\n- Store 2: 739 units\n- Store 3: 491 units\n- Store 4: 766 units\n- Store 5: 854 units\n\nSupply Capacity of Each Distribution Center (in units):\n- Distribution Center 1: 1,308 units\n- Distribution Center 2: 1,575 units\n- Distribution Center 3: 834 units\n- Distribution Center 4: 1,005 units\n- Distribution Center 5: 1,904 units\n- Distribution Center 6: 1,825 units\n- Distribution Center 7: 1,821 units\n- Distribution Center 8: 1,365 units\n\nQuestion:\nConsidering all the given data about opening costs, transportation costs per unit to stores, demand of each retail store, and supply capacity of each distribution center, what is the optimal total cost for SupplyChainMax to establish distribution centers and transport goods to fully meet the demands of all five retail stores? This optimal total cost includes both the opening costs of the selected distribution centers and the transportation costs of supplying the stores.",
    "ground_truth": 394198.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Facility Location",
        "modeling_type": "MILP",
        "industry_sector": "Retail",
        "reason": "The problem involves selecting which distribution centers to open (a location decision) to minimize total costs (fixed opening costs and variable transportation costs) while meeting store demands and respecting DC capacities. This is a classic uncapacitated or capacitated facility location problem. The decision variables for opening DCs are binary, and flow variables are continuous, leading to a Mixed-Integer Linear Program. The application is clearly within the retail sector's supply chain operations."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E071",
    "description": "In the heart of a bustling metropolis, an expansive network of waterways and canals forms the lifeline for its residents, connecting 9 critical distribution centers that manage the flow of water from the city's reservoirs to its farthest suburbs. This intricate system, designed to ensure the smooth and efficient delivery of water, consists of channels with varying capacities, reflecting the maximum volumes of water (in thousands of gallons per hour) that can traverse these connections without causing overflow or damage.\n\nHere's a detailed look at the capacities of each channel in this vital network:\n\n- From Distribution Center 0 (Source), the water can be directed to Centers 1 through 8 with capacities of 9, 7, 18, 0, 0, 7, 0, and 2 thousand gallons per hour, respectively.\n- Center 1 has the capability to forward water to other centers, including sending 15, 11, 5, 20, 15, 18, 9, and 15 thousand gallons per hour to Centers 0 through 8 (excluding itself).\n- Similarly, the capacities from Center 2 to others are marked by flows of 3, 8, 0, 10, 16, 18, 8, 0, and 20 thousand gallons per hour to Centers 0 through 8, respectively.\n- The flow continues from Center 3 with capacities of 13, 3, 7, 0, 20, 13, 16, 6, and 20 thousand gallons per hour to the respective centers.\n- From Center 4, water can be distributed with capacities of 7, 20, 2, 4, 0, 9, 3, 14, and 2 thousand gallons per hour.\n- Center 5 allows for a distribution flow of 17, 10, 5, 1, 4, 0, 4, 3, and 20 thousand gallons per hour towards the respective centers.\n- The network from Center 6 can support flows of 0, 20, 10, 10, 15, 5, 0, 1, and 10 thousand gallons per hour.\n- From Center 7, water can be directed with capacities of 10, 3, 9, 4, 3, 13, 18, 0, and 20 thousand gallons per hour.\n- Finally, Center 8 can send back or redistribute water with capacities of 2, 12, 10, 5, 15, 14, 0, 10, and 0 thousand gallons per hour to the respective centers.\n\nIn this network, a capacity of \"0\" indicates the absence of a direct channel between two centers, necessitating the redirection of flow through other centers to ensure connectivity.\n\nGiven this complex and dynamic system, the city's water management team faces the challenging task of determining the maximum volume of water that can be efficiently distributed from Distribution Center 0 (the source) to all other centers, culminating at the final node (Center 8) which represents the city's outskirts. This calculation is crucial for optimizing the water supply and meeting the growing needs of the city's population.\n\nWhat is the maximum amount of water (in thousands of gallons per hour) that can be distributed from the source to the outskirts without exceeding the specified capacities of the channels in the network?",
    "ground_truth": 43.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Network Flow",
        "modeling_type": "LP",
        "industry_sector": "Utilities",
        "reason": "The problem describes a network of distribution centers and channels with capacities, aiming to find the maximum flow from a source to a sink. This is a classic maximum flow problem, which can be formulated as a Linear Program. The application is clearly in water distribution, which falls under the Utilities sector."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E025",
    "description": "Imagine you're on a mission to optimize your daily meal plan. You're aiming to fulfill your daily nutritional intake while keeping your expenses as low as possible. In front of you, you have a selection of nine different food items: Beef, Pasta, Broccoli, Chicken, Apple, Pork, Lentils, Eggs, and Cheese. Each of these foods has its own cost, protein, carbohydrate, and calorie content.\n\nLet's take a look at the nutritional details and price of each food item:\n\n- Beef: For a cost of $5, serves you with 18 grams of protein, 13 grams of carbohydrates, and 233 calories. \n- Pasta: Comes at $6, but it provides 2 grams of protein, 25 grams of carbohydrates, and 251 calories. \n- Broccoli: Costs $5, and gives 7 grams of protein, 30 grams of carbohydrates, and 191 calories. \n- Chicken: Offers 20 grams of protein, 16 grams of carbohydrates, and 231 calories at a cost of $4. \n- Apple: At $1, provides 5 grams of protein, 6 grams of carbohydrates, and 111 calories. \n- Pork: Priced at $6, gives you 13 grams of protein, 9 grams of carbohydrates, and 275 calories. \n- Lentils: Costing $1, it provides 15 grams of protein, 18 grams of carbohydrates, and 99 calories. \n- Eggs: For $2, they serve 20 grams of protein, 18 grams of carbohydrates, and 210 calories. \n- Cheese: At $7, it provides 9 grams of protein, 14 grams of carbohydrates, and 74 calories. \n\nYour daily dietary requirements are to consume at least 68 grams of protein, 151 grams of carbohydrates, and 1900 calories. The question before you is: How can you meet these nutritional targets in the most cost-effective way using the food options provided? In other words, what is the least amount of money you need to spend in order to fulfill your daily nutritional requirements?",
    "ground_truth": 18.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Resource Allocation",
        "modeling_type": "LP",
        "industry_sector": "Health",
        "reason": "The problem involves allocating food items (resources) to meet minimum nutritional requirements (constraints) at the lowest possible cost (objective function). Since the decision variables (quantity of each food item) can be continuous and all relationships are linear, it falls under Linear Programming. The application is directly related to dietary planning and nutritional intake, which is a health-related concern."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E098",
    "description": "LogiSphere Inc. is at a crossroads in determining the most cost-efficient strategy to supply nine retail stores with goods from a selection of five potential distribution centers. Each center has a unique opening cost and a maximum supply capacity. The challenge is further complicated by the variable transportation costs from these centers to the retail stores. LogiSphere's goal is to fulfill the demand at each retail store while minimizing the total cost, which encompasses the opening costs of the distribution centers and the transportation costs of the goods.\n\n**Given Data:**\n\n- **Number of Potential Distribution Centers:** 5\n- **Number of Retail Stores Needing Supply:** 9\n\n**Opening Costs for Each Distribution Center (in dollars):**\n- Center 1: $151,000\n- Center 2: $192,000\n- Center 3: $114,000\n- Center 4: $171,000\n- Center 5: $160,000\n\n**Transportation Cost Per Unit from Each Distribution Center to Retail Stores (in dollars):**\n- From Center 1 to Stores: $5 to Store 1, $2 to Store 2, $3 to Store 3, $3 to Store 4, $3 to Store 5, $5 to Store 6, $4 to Store 7, $3 to Store 8, $5 to Store 9\n- From Center 2 to Stores: $2 to Store 1, $4 to Store 2, $2 to Store 3, $4 to Store 4, $5 to Store 5, $1 to Store 6, $4 to Store 7, $2 to Store 8, $5 to Store 9\n- From Center 3 to Stores: $4 to Store 1, $1 to Store 2, $1 to Store 3, $3 to Store 4, $3 to Store 5, $2 to Store 6, $4 to Store 7, $4 to Store 8, $3 to Store 9\n- From Center 4 to Stores: $4 to Store 1, $4 to Store 2, $1 to Store 3, $3 to Store 4, $5 to Store 5, $3 to Store 6, $5 to Store 7, $1 to Store 8, $2 to Store 9\n- From Center 5 to Stores: $4 to Store 1, $1 to Store 2, $4 to Store 3, $2 to Store 4, $2 to Store 5, $1 to Store 6, $2 to Store 7, $5 to Store 8, $2 to Store 9\n\n**Demand of Each Retail Store (in units):**\n- Store 1: 739 units\n- Store 2: 491 units\n- Store 3: 766 units\n- Store 4: 854 units\n- Store 5: 827 units\n- Store 6: 908 units\n- Store 7: 434 units\n- Store 8: 605 units\n- Store 9: 480 units\n\n**Supply Capacity of Each Distribution Center (in units):**\n- Center 1: 1825 units\n- Center 2: 1821 units\n- Center 3: 1365 units\n- Center 4: 1929 units\n- Center 5: 1502 units\n\n**Question:**\n\nWhat is the optimal total cost for LogiSphere Inc. to open distribution centers and transport goods in order to meet all the retail stores' demands? This cost includes both the opening costs of the centers and the transportation costs of supplying the stores.",
    "ground_truth": 608437.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Facility Location",
        "modeling_type": "MILP",
        "industry_sector": "Retail",
        "reason": "The problem involves deciding which distribution centers to open (a binary decision) and how much to transport from opened centers to retail stores, minimizing total fixed opening costs and variable transportation costs. This is a classic uncapacitated or capacitated facility location problem. The presence of binary decision variables for opening centers and continuous variables for transportation quantities, along with linear objective and constraints, indicates a Mixed-Integer Linear Program. The application is directly related to supplying goods to retail stores, placing it in the retail sector."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E014",
    "description": "You have been assigned as the personal dietitian for a professional athlete, who is intent on maintaining a strict diet while also minimizing their grocery bill. You have six different food items to utilize: Eggs, Chicken, Tofu, Salmon, Brown Rice, and Spinach. Each of these food items provides specific amounts of protein, carbohydrates, and calories, and each comes at a different cost.\n\nHere's a quick breakdown of what each food offers and its cost:\n\n- Eggs: Provide 1 gram of protein, 13 grams of carbohydrates, and 211 calories for $10.\n- Chicken: Offers 4 grams of protein, 10 grams of carbohydrates, and 256 calories for $9.\n- Tofu: Delivers a whopping 13 grams of protein, 9 grams of carbohydrates, and 273 calories for just $2.\n- Salmon: Gives 8 grams of protein, 3 grams of carbohydrates, and 54 calories for $10.\n- Brown Rice: Provides 7 grams of protein, 13 grams of carbohydrates, and 93 calories for $8.\n- Spinach: Packs in 8 grams of protein, 16 grams of carbohydrates, and 52 calories for only $1.\n\nThe athlete's nutritional goals are at least 60 grams of protein, 122 grams of carbohydrates, and 2028 calories daily. \n\nYour challenge is to design the most cost-effective daily meal plan that meets all these nutritional targets using these six food options. What is the least amount of money the athlete would have to spend to meet their nutritional requirements?",
    "ground_truth": 18.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Blending",
        "modeling_type": "LP",
        "industry_sector": "Health",
        "reason": "The problem involves mixing different food items (ingredients) to meet specific nutritional requirements (blend specifications) at a minimum cost, which is a classic blending problem. Since the decision variables (amount of each food item) can be continuous and all relationships are linear, it can be formulated as a Linear Program."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E067",
    "description": "Welcome to the challenge of optimizing the logistics network of a futuristic city, connected by an advanced transportation system comprising 8 crucial nodes. This city's system is designed to maximize the efficiency of goods transport from the central distribution hub to a primary delivery station, passing through various checkpoints and distribution centers along the way.\n\nHere's a detailed view of the transportation capacities (in thousands of units) that each route can handle:\n\n- From Node 0 (Source): Can dispatch goods to Node 1 (3 units), Node 2 (7 units), Node 3 (2 units), Node 4 (18 units), Node 5 (18 units), Node 6 (14 units), and Node 7 (10 units).\n- From Node 1: Can send goods to Node 0 (1 unit), Node 2 (10 units), Node 3 (16 units), Node 4 (14 units), Node 6 (6 units), and Node 7 (10 units).\n- From Node 2: Can transport goods to Node 0 (4 units), Node 3 (7 units), Node 4 (2 units), Node 5 (2 units), Node 6 (6 units), and Node 7 (10 units).\n- From Node 3: Can move goods to Node 0 (2 units), Node 1 (3 units), Node 2 (7 units), Node 4 (20 units), Node 5 (8 units), Node 6 (6 units), and Node 7 (10 units).\n- From Node 4: Can dispatch goods to Node 0 (1 unit), Node 1 (20 units), Node 2 (4 units), Node 3 (8 units), Node 5 (13 units), Node 6 (8 units), and Node 7 (1 unit).\n- From Node 5: Can send goods to Node 0 (16 units), Node 1 (9 units), Node 2 (17 units), Node 3 (17 units), Node 4 (11 units), Node 6 (7 units), and Node 7 (8 units).\n- From Node 6: Can transport goods to Node 0 (3 units), Node 1 (7 units), Node 2 (14 units), Node 3 (1 unit), Node 4 (20 units), Node 5 (5 units), and Node 7 (13 units).\n- From Node 7 (Destination): Can receive goods from Node 0 (3 units), Node 1 (6 units), Node 2 (5 units), Node 3 (1 unit), Node 4 (14 units), Node 5 (20 units), and Node 6 (9 units).\n\nA capacity of \"0\" indicates there is no direct route available between those two nodes.\n\nThe goal is to determine the maximum amount of goods (in thousands of units) that can be transported from the central distribution hub (Node 0) to the primary delivery station (Node 7) without exceeding the transport capacity of any route.\n\nWhat is the optimal value of goods (in thousands of units) that can be transported from the source to the destination?",
    "ground_truth": 62.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Network Flow",
        "modeling_type": "LP",
        "industry_sector": "Logistics",
        "reason": "The problem asks to maximize the flow of goods from a source node to a destination node through a network with capacity constraints on each arc, which is a classic maximum flow problem. This can be formulated as a Linear Program (LP)."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E088",
    "description": "Distribution Dynamics Inc. has a strategic challenge to efficiently supply its seven retail stores from a choice of five potential distribution centers. This operation has to manage not only the differing opening costs of each distribution center but also the variability in their capacity to meet demands and the transportation costs involved in shipping goods to each retail store. The company aims to fulfill the demand at each retail location while minimizing the total cost involved, which encompasses the opening costs of the distribution centers and the transportation costs of the goods.\n\nGiven Data:\n- Number of Potential Distribution Centers: 5\n- Number of Retail Stores Needing Supply: 7\n\nOpening Costs for Each Distribution Center (in dollars):\n- Center 1: $151,000\n- Center 2: $192,000\n- Center 3: $114,000\n- Center 4: $171,000\n- Center 5: $160,000\n\nTransportation Cost Per Unit from Each Distribution Center to Retail Stores (in dollars):\n- From Center 1: $5 to Store 1, $2 to Store 2, $3 to Store 3, $3 to Store 4, $3 to Store 5, $5 to Store 6, $4 to Store 7\n- From Center 2: $3 to Store 1, $5 to Store 2, $2 to Store 3, $4 to Store 4, $2 to Store 5, $4 to Store 6, $5 to Store 7\n- From Center 3: $1 to Store 1, $4 to Store 2, $2 to Store 3, $5 to Store 4, $4 to Store 5, $1 to Store 6, $1 to Store 7\n- From Center 4: $3 to Store 1, $3 to Store 2, $2 to Store 3, $4 to Store 4, $4 to Store 5, $3 to Store 6, $4 to Store 7\n- From Center 5: $4 to Store 1, $1 to Store 2, $3 to Store 3, $5 to Store 4, $3 to Store 5, $5 to Store 6, $1 to Store 7\n\nDemand of Each Retail Store (in units):\n- Store 1: 566 units\n- Store 2: 673 units\n- Store 3: 787 units\n- Store 4: 1000 units\n- Store 5: 715 units\n- Store 6: 413 units\n- Store 7: 641 units\n\nSupply Capacity of Each Distribution Center (in units):\n- Center 1: 1576 units\n- Center 2: 1364 units\n- Center 3: 1697 units\n- Center 4: 891 units\n- Center 5: 1755 units\n\nQuestion:\nWhat is the optimal total cost for Distribution Dynamics Inc. to open the necessary distribution centers and transport goods in order to meet all retail stores' demands at the lowest possible cost, taking into account both the opening costs of the centers and the transportation costs of supplying the stores?",
    "ground_truth": 434081.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Facility Location",
        "modeling_type": "MILP",
        "industry_sector": "Retail",
        "reason": "The problem involves deciding which distribution centers to open (a binary decision) and how much to ship from opened centers to retail stores, minimizing total fixed opening costs and variable transportation costs. This is a classic uncapacitated or capacitated facility location problem, which is typically formulated as a Mixed-Integer Linear Program."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E001",
    "description": "Imagine you are in charge of planning a week's worth of meals for a small group and need to ensure everyone gets the right amount of nutrients without overspending. You have four different food items to choose from, each with its own nutritional content and cost.\n\nHere's what each food item offers:\n- Food_1: Provides 19 grams of protein, 9 grams of carbohydrates, and 83 calories for $7.\n- Food_2: Offers 4 grams of protein, 16 grams of carbohydrates, and 166 calories for $7.\n- Food_3: Contains 3 grams of protein, 11 grams of carbohydrates, and 71 calories for $10.\n- Food_4: Delivers 8 grams of protein, 7 grams of carbohydrates, and 56 calories for $2.\n\nYour goal is to meet the following nutritional requirements for the group:\n- At least 84 grams of protein,\n- At least 132 grams of carbohydrates,\n- At least 1990 calories.\n\nYour challenge is to determine the most cost-effective way to purchase these food items to meet or exceed the nutritional requirements. What is the minimal cost to meet these dietary needs?",
    "ground_truth": 72.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Blending",
        "modeling_type": "LP",
        "industry_sector": "Health",
        "reason": "The problem involves combining different food items (ingredients) to meet specific nutritional requirements (blending constraints) at a minimum cost. Since the decision variables (quantities of food items) can be continuous and the objective and constraints are linear, it's a Linear Programming problem. The application is directly related to dietary planning and nutrition, falling under the health sector."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E024",
    "description": "Imagine you're on a mission to plan your meals to meet specific dietary needs for the day, but you also want to keep your spending within limits. You have four types of food items on your list: Chicken, Rice, Broccoli, and Eggs. Each of these foods has its own nutritional value in terms of protein, carbohydrates, and calories, and also comes at a different price.\n\nHere's a quick overview of what each food item offers and how much they cost:\n\n- Chicken: Provides 17 grams of protein, 6 grams of carbohydrates, and 94 calories for $7.\n- Rice: Offers 20 grams of protein, 13 grams of carbohydrates, and 74 calories for $10.\n- Broccoli: Comes with 3 grams of protein, a high 25 grams of carbohydrates, and 73 calories for $9.\n- Eggs: Are a budget-friendly option providing 18 grams of protein, 20 grams of carbohydrates, and 119 calories for only $2.\n\nYou need to ensure that your daily intake should consist of at least 84 grams of protein, 117 grams of carbohydrates, and 1554 calories. Your task is to figure out the most cost-effective way to meet these nutritional targets with the available food options. So, what is the minimal cost you need to incur to satisfy your dietary requirements? Remember, your response should indicate the optimal cost value, under the scenario of food selection.",
    "ground_truth": 28.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Resource Allocation",
        "modeling_type": "LP",
        "industry_sector": "Health",
        "reason": "The problem involves allocating food items (resources) to meet nutritional targets (constraints) while minimizing cost, which is a classic resource allocation problem. Since the quantities of food items can be continuous and all relationships are linear, it can be modeled as a Linear Program. The application directly relates to dietary planning and nutritional intake, placing it in the health sector."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E056",
    "description": "Imagine a bustling city where seven primary communication stations are in operation. These stations, ranging from a central source (Station 0) to the main endpoint (Station 6), are interconnected by a network of telecommunication lines with varying transfer capacities.\n\nHere are the capacities of each connection, representing the maximum amount of data (in terabytes) that can be transferred from one station to another:\n\n- From Station 0 (Source): Can send data to Station 1 (17TB), Station 2 (3TB), Station 3 (20TB), Station 4 (11TB), Station 5 (11TB), and Station 6 (3TB).\n- From Station 1: Can send data to Station 0 (11TB), Station 2 (12TB), Station 3 (18TB), Station 4 (5TB), Station 5 (6TB), and Station 6 (4TB).\n- From Station 2: Can send data to Station 0 (7TB), Station 1 (2TB), Station 3 (15TB), Station 4 (13TB), Station 5 (20TB), and Station 6 (18TB).\n- From Station 3: Can send data to Station 0 (7TB), Station 1 (4TB), Station 2 (2TB), Station 4 (2TB), Station 5 (15TB), and Station 6 (3TB).\n- From Station 4: Can send data to Station 0 (19TB), Station 1 (12TB), Station 2 (16TB), Station 3 (4TB), Station 5 (19TB), and Station 6 (4TB).\n- From Station 5: Can send data to Station 0 (13TB), Station 1 (20TB), Station 2 (10TB), Station 3 (14TB), Station 4 (15TB), and Station 6 (1TB).\n- From Station 6 (Endpoint): Can send data back to Station 0 (3TB), Station 1 (3TB), Station 2 (6TB), Station 3 (20TB), Station 4 (9TB), and Station 5 (10TB).\n\nIn this scenario, a capacity of \"0\" indicates there is no direct telecommunication link between the two respective stations.\n\nYour challenge is to determine the maximum amount of data that can be transferred from Station 0 (the source) to Station 6 (the endpoint) per hour, while ensuring the data flow along each telecommunication line does not exceed its set capacity. What is the maximum amount of data, in terabytes, that can be transferred from the source to the endpoint within one hour?",
    "ground_truth": 33.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Network Flow",
        "modeling_type": "LP",
        "industry_sector": "Telecommunications",
        "reason": "The problem asks to find the maximum data transfer from a source to a sink through a network with capacity constraints on each link, which is a classic maximum flow problem. This can be formulated as a Linear Program (LP) where the objective is to maximize flow and constraints ensure flow conservation and capacity limits. The application is clearly within telecommunications, dealing with data transfer between communication stations."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E030",
    "description": "You're in charge of crafting a meal plan for a week, aiming to meet certain nutritional requirements while keeping your grocery bill to a minimum. There are seven food options you're considering: Chicken, Tuna, Eggs, Beef, Rice, Apples, and Bread. Each food item provides distinct amounts of protein, carbohydrates, and calories, and has a different price.\n\nHere are the details for each food:\n\n- Chicken: Provides 18 grams of protein, 23 grams of carbohydrates, and 217 calories for $3.\n- Tuna: Offers 12 grams of protein, 30 grams of carbohydrates, and 182 calories for $10.\n- Eggs: Contains 7 grams of protein, 16 grams of carbohydrates, and 79 calories for $10.\n- Beef: Delivers 17 grams of protein, 26 grams of carbohydrates, and 295 calories for $7.\n- Rice: Supplies 3 grams of protein, 30 grams of carbohydrates, and 264 calories for just $4.\n- Apples: Gives 4 grams of protein, 6 grams of carbohydrates, and 160 calories for $6.\n- Bread: Carries 4 grams of protein, 23 grams of carbohydrates, and 141 calories for $5.\n\nYour nutritional targets for the week are as follows: 59 grams of protein, 160 grams of carbohydrates, and 1809 calories.\n\nYour challenge is to find the most economical way of meeting these nutritional requirements with the food items available. What is the least possible amount you can spend to meet your nutritional goals for the week?",
    "ground_truth": 26.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Blending",
        "modeling_type": "LP",
        "industry_sector": "Health",
        "reason": "The problem involves determining the optimal mix of food items to meet nutritional targets at minimum cost, which is a classic blending problem. Since the decision variables (quantities of food) can be continuous and all relationships are linear, it can be formulated as a Linear Program. The application directly relates to dietary planning and nutritional intake, placing it in the health sector."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E012",
    "description": "Imagine you are on a mission to take control of your diet, meeting all your nutritional needs without breaking the bank. As a savvy shopper, you've narrowed down your food options to five different items, each providing different amounts of nutrients at varying costs. \n\nHere is a summary of what each food option offers and their respective costs:\n\n- Chicken: It provides 18 grams of protein, 6 grams of carbohydrates, and 142 calories at a cost of $4.\n- Rice: This food item gives you 12 grams of protein, 28 grams of carbohydrates, and 88 calories for $8.\n- Broccoli: For $7, it offers 13 grams of protein, 19 grams of carbohydrates, and 137 calories.\n- Tofu: At a cost of $10, you get 5 grams of protein, 16 grams of carbohydrates, and 141 calories.\n- Beans: This item provides an impressive 10 grams of protein, 20 grams of carbohydrates, and 150 calories for only $1.\n\nYour daily nutritional targets are to consume at least 56 grams of protein, 194 grams of carbohydrates, and 2012 calories. The key challenge here is to meet these dietary requirements in the most cost-effective way possible, using any combination of the food items listed above. \n\nNow, the question is, what is the minimal cost to meet your daily nutritional requirements using these food items?",
    "ground_truth": 14.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Blending",
        "modeling_type": "LP",
        "industry_sector": "Health",
        "reason": "The problem involves combining different food items (ingredients) to meet nutritional requirements (specifications) at a minimum cost, which is a classic blending problem. Since the quantities of food items can be continuous and the objective and constraints are linear, it can be formulated as a Linear Program."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E053",
    "description": "Let's consider a complex transportation network comprised of 6 major cargo hubs, stretching from a main dispatch center to a primary delivery destination. These hubs are interconnected by roads, each with its own weight limit for cargo transportation.\n\nHere's how the weight limits of each road are distributed, reflecting the maximum amount of cargo (in tons) that can be transported from one hub to another:\n\n- From Hub 0 (Dispatch Center): Can send cargo to Hub 1 (7 tons), Hub 2 (8 tons), Hub 3 (1 ton), Hub 4 (2 tons), and Hub 5 (4 tons).\n- From Hub 1: Can send cargo to Hub 0 (15 tons), Hub 2 (16 tons), Hub 4 (9 tons), and Hub 5 (13 tons).\n- From Hub 2: Can send cargo to Hub 0 (9 tons), Hub 1 (1 ton), Hub 3 (9 tons), Hub 4 (13 tons), and Hub 5 (13 tons).\n- From Hub 3: Can send cargo to Hub 0 (10 tons), Hub 1 (11 tons), Hub 2 (19 tons), Hub 4 (1 ton), and Hub 5 (12 tons).\n- From Hub 4: Can send cargo to Hub 0 (15 tons), Hub 1 (16 tons), Hub 2 (7 tons), Hub 3 (11 tons), and Hub 5 (19 tons).\n- From Hub 5 (Destination): Can send cargo back to Hub 0 (10 tons), Hub 1 (12 tons), Hub 2 (12 tons), Hub 3 (12 tons), and Hub 4 (20 tons).\n\nIn this model, a capacity of \"0\" indicates there is no direct road connection between those two hubs.\n\nThe challenge is to determine the maximum amount of cargo that can be transported from Hub 0 (the dispatch center) to Hub 5 (the destination) per day, in a manner that the cargo on each road does not surpass its listed weight limit. What is the maximum amount of cargo that can be delivered from the dispatch center to the destination in tons per day? Please note that the answer should provide only the optimal value under the maximum flow scenario, and all the data in the problem details should be included in the created question.",
    "ground_truth": 22.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Network Flow",
        "modeling_type": "LP",
        "industry_sector": "Transportation",
        "reason": "The problem asks to find the maximum amount of cargo that can be transported from a dispatch center (source) to a destination hub (sink) through a network of interconnected hubs with capacity limits on each road. This is a classic maximum flow problem, which can be formulated as a Linear Program (LP). The application is clearly within the transportation sector, dealing with cargo movement."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E078",
    "description": "In the bustling world of retail, LogiChain, a renowned logistics company, is at a crossroads in determining the most efficient way to distribute products to its network of eight retail stores. The challenge lies in selecting from four strategic distribution centers, each with its distinct opening costs and supply capacities. The goal is to ensure that each store's demand is met with the least total cost, incorporating both the opening of distribution centers and the transportation costs of delivering goods.\n\nHere are the specifics of the situation:\n\n- LogiChain can open any of the four distribution centers, each with a different opening cost.\n- There are eight retail stores in need of supplies, each with its unique demand.\n- The transportation cost per unit of product varies not only from one distribution center to another but also from one store to another.\n\nThe details are as follows:\n\nOpening Costs for Each Distribution Center (in dollars):\n- Center 1: $151,000\n- Center 2: $192,000\n- Center 3: $114,000\n- Center 4: $171,000\n\nTransportation Cost Per Unit from Each Distribution Center to Retail Stores (in dollars):\n- From Center 1: $5 to Store 1, $5 to Store 2, $2 to Store 3, $3 to Store 4, $3 to Store 5, $3 to Store 6, $5 to Store 7, $4 to Store 8\n- From Center 2: $3 to Store 1, $5 to Store 2, $2 to Store 3, $4 to Store 4, $2 to Store 5, $4 to Store 6, $5 to Store 7, $1 to Store 8\n- From Center 3: $4 to Store 1, $2 to Store 2, $5 to Store 3, $4 to Store 4, $1 to Store 5, $1 to Store 6, $3 to Store 7, $3 to Store 8\n- From Center 4: $2 to Store 1, $4 to Store 2, $4 to Store 3, $3 to Store 4, $4 to Store 5, $4 to Store 6, $1 to Store 7, $3 to Store 8\n\nDemand of Each Retail Store (in units):\n- Store 1: 884 units\n- Store 2: 420 units\n- Store 3: 566 units\n- Store 4: 673 units\n- Store 5: 787 units\n- Store 6: 1000 units\n- Store 7: 715 units\n- Store 8: 413 units\n\nSupply Capacity of Each Distribution Center (in units):\n- Center 1: 1041 units\n- Center 2: 1576 units\n- Center 3: 1364 units\n- Center 4: 1697 units\n\nGiven these variables, LogiChain must make a calculated decision on which distribution centers to open and how to allocate shipments to meet the demands of the eight stores in the most cost-effective manner.\n\nQuestion:\nWhat is the optimal total cost for LogiChain to open distribution centers and transport goods to satisfy the demand of all eight retail stores, taking both the opening costs and transportation costs into account?",
    "ground_truth": 637573.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Facility Location",
        "modeling_type": "MILP",
        "industry_sector": "Retail",
        "reason": "The problem involves deciding which distribution centers to open (a facility location decision) and then how to allocate products to stores, minimizing total costs. The presence of binary decisions (open/not open a DC) and continuous variables (amount shipped) with linear objective and constraints points to a Mixed-Integer Linear Program."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E069",
    "description": "Welcome to the fictional city of Aquaville, where the city's administration is working on a groundbreaking project to maximize the efficiency of its new water distribution network. This network is designed to ensure that every corner of the city has access to water, especially in times of need. The system is made up of 9 pivotal stations - including the main water source and the central distribution hub - connected by a series of pipelines with varying capacities.\n\nHere's a closer look at the capacities (in thousands of gallons per hour) that each pipeline can handle, showcasing the maximum flow from one station to another across the city:\n\n- From Station 0 (Source): Water can be directed to Station 1 (2 gallons), Station 2 (8 gallons), Station 3 (17 gallons), Station 4 (16 gallons), Station 5 (20 gallons), Station 6 (15 gallons), Station 7 (12 gallons), and Station 8 (9 gallons).\n- From Station 1: Water can flow to Station 0 (4 gallons), Station 2 (11 gallons), Station 3 (7 gallons), Station 4 (3 gallons), Station 5 (19 gallons), Station 6 (10 gallons), Station 7 (19 gallons), and Station 8 (8 gallons).\n- From Station 2: Water can move to Station 0 (14 gallons), Station 1 (7 gallons), Station 3 (7 gallons), Station 4 (13 gallons), Station 5 (19 gallons), Station 6 (18 gallons), Station 7 (20 gallons), and Station 8 (5 gallons).\n- From Station 3: Water can be sent to Station 0 (17 gallons), Station 1 (17 gallons), Station 2 (7 gallons), Station 4 (11 gallons), Station 5 (7 gallons), Station 6 (17 gallons), Station 7 (0 gallons), and Station 8 (10 gallons).\n- From Station 4: Water can be distributed to Station 0 (20 gallons), Station 1 (10 gallons), Station 2 (2 gallons), Station 3 (18 gallons), Station 5 (15 gallons), Station 6 (8 gallons), Station 7 (6 gallons), and Station 8 (18 gallons).\n- From Station 5: Water can be channeled to Station 0 (4 gallons), Station 1 (9 gallons), Station 2 (12 gallons), Station 3 (1 gallon), Station 4 (17 gallons), Station 6 (0 gallons), Station 7 (13 gallons), and Station 8 (18 gallons).\n- From Station 6: Water can flow to Station 0 (12 gallons), Station 1 (15 gallons), Station 2 (12 gallons), Station 3 (19 gallons), Station 4 (18 gallons), Station 5 (19 gallons), Station 7 (6 gallons), and Station 8 (17 gallons).\n- From Station 7: Water can be directed to Station 0 (14 gallons), Station 1 (1 gallon), Station 2 (17 gallons), Station 3 (20 gallons), Station 4 (11 gallons), Station 5 (20 gallons), Station 6 (6 gallons), and Station 8 (4 gallons).\n- From Station 8 (Destination): Water can be sent back to Station 0 (19 gallons), Station 1 (3 gallons), Station 2 (19 gallons), Station 3 (12 gallons), Station 4 (8 gallons), Station 5 (18 gallons), Station 6 (17 gallons), and Station 7 (13 gallons).\n\nIn this intricate network, a capacity of \"0\" implies that there is no direct connection for water flow between those two specific stations.\n\nThe critical mission is to determine the maximum quantity of water that can be efficiently distributed from Station 0, the primary source, to Station 8, the central distribution hub, per hour. The flow through each pipeline must not exceed its maximum specified capacity.\n\nWhat is the optimal amount of water (in thousands of gallons per hour) that can be transported from the source to the distribution hub, ensuring the network operates at its maximum potential?",
    "ground_truth": 89.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Network Flow",
        "modeling_type": "LP",
        "industry_sector": "Utilities",
        "reason": "The problem asks to find the maximum quantity of water that can be transported from a source to a destination through a network of pipelines with given capacities, which is a classic maximum flow problem. This can be formulated as a Linear Program (LP)."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E086",
    "description": "In the bustling world of retail and distribution, a major company, GlobalSupply, is facing a strategic challenge. It needs to efficiently supply its products to eight different retail stores, each with its own demand for goods. To achieve this, GlobalSupply is considering opening up to eight different distribution centers, but each center comes with its own set of opening costs and has a specific capacity limit. Additionally, the cost of transporting goods from these distribution centers to the retail stores varies, adding another layer of complexity to the decision-making process. GlobalSupply's primary objective is to fulfill the demand at each retail store while minimizing the total cost, which includes both the opening costs of the distribution centers and the transportation costs of the goods.\n\nGiven Data:\n- Number of Potential Distribution Centers: 8\n- Number of Retail Stores Needing Supply: 8\n\nOpening Costs for Each Distribution Center (in dollars):\n- Center 1: $151,000\n- Center 2: $192,000\n- Center 3: $114,000\n- Center 4: $171,000\n- Center 5: $160,000\n- Center 6: $120,000\n- Center 7: $182,000\n- Center 8: $186,000\n\nTransportation Cost Per Unit from Each Distribution Center to Retail Stores (in dollars):\n- From Center 1 to Stores: $3 to Store 1, $3 to Store 2, $5 to Store 3, $4 to Store 4, $3 to Store 5, $5 to Store 6, $2 to Store 7, $4 to Store 8\n- From Center 2 to Stores: $2 to Store 1, $4 to Store 2, $5 to Store 3, $1 to Store 4, $4 to Store 5, $2 to Store 6, $5 to Store 7, $4 to Store 8\n- From Center 3 to Stores: $1 to Store 1, $1 to Store 2, $3 to Store 3, $3 to Store 4, $2 to Store 5, $4 to Store 6, $4 to Store 7, $3 to Store 8\n- From Center 4 to Stores: $4 to Store 1, $4 to Store 2, $1 to Store 3, $3 to Store 4, $5 to Store 5, $3 to Store 6, $5 to Store 7, $1 to Store 8\n- From Center 5 to Stores: $2 to Store 1, $4 to Store 2, $1 to Store 3, $4 to Store 4, $2 to Store 5, $2 to Store 6, $1 to Store 7, $2 to Store 8\n- From Center 6 to Stores: $5 to Store 1, $2 to Store 2, $4 to Store 3, $4 to Store 4, $4 to Store 5, $4 to Store 6, $5 to Store 7, $3 to Store 8\n- From Center 7 to Stores: $1 to Store 1, $4 to Store 2, $2 to Store 3, $4 to Store 4, $2 to Store 5, $2 to Store 6, $4 to Store 7, $5 to Store 8\n- From Center 8 to Stores: $2 to Store 1, $2 to Store 2, $4 to Store 3, $2 to Store 4, $2 to Store 5, $4 to Store 6, $4 to Store 7, $1 to Store 8\n\nDemand of Each Retail Store (in units):\n- Store 1: 695 units\n- Store 2: 737 units\n- Store 3: 452 units\n- Store 4: 616 units\n- Store 5: 587 units\n- Store 6: 779 units\n- Store 7: 892 units\n- Store 8: 440 units\n\nSupply Capacity of Each Distribution Center (in units):\n- Center 1: 1980 units\n- Center 2: 814 units\n- Center 3: 864 units\n- Center 4: 1320 units\n- Center 5: 1952 units\n- Center 6: 1447 units\n- Center 7: 1886 units\n- Center 8: 1962 units\n\nQuestion:\nConsidering these details, what is the optimal total cost for GlobalSupply to open distribution centers and transport goods to meet all retail stores' demands? This cost includes both the opening costs of the centers and the transportation costs of supplying the stores.",
    "ground_truth": 443177.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Facility Location",
        "modeling_type": "MILP",
        "industry_sector": "Retail",
        "reason": "The problem involves deciding which distribution centers to open (a facility location decision) and how to allocate products from opened centers to stores to meet demand, while minimizing total costs. The presence of fixed opening costs for centers and continuous transportation flows, along with binary decisions for opening centers, points to a Mixed-Integer Linear Programming formulation. The application is clearly within the retail and distribution sector."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E044",
    "description": "Imagine a scenario where a salesperson must visit four distinct cities to conduct business meetings. Let's label these cities as City 1, City 2, City 3, and City 4. The salesperson can start their trip from any city, but they must visit each city exactly once and then return to the starting point. The main objective is to minimize the total cost of traveling between these cities.\n\nHere’s a detailed breakdown of the travel costs:\n- From City 1, the travel cost is 27 units to City 2, 48 units to City 3, and 76 units to City 4.\n- From City 2, it costs 27 units to return to City 1, 82 units to reach City 3, and 88 units to go to City 4.\n- From City 3, traveling back to City 1 costs 48 units, moving to City 2 costs 82 units, and it is 97 units to journey to City 4.\n- Lastly, from City 4, it costs 76 units to go back to City 1, 88 units to travel to City 2, and 97 units to move to City 3.\n\nWhat is the minimum total travel cost for the salesperson to visit each of these cities exactly once and return to the starting city?",
    "ground_truth": 248.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Routing",
        "modeling_type": "IP",
        "industry_sector": "Transportation",
        "reason": "The problem describes a salesperson visiting multiple cities and returning to the start, which is a classic Traveling Salesperson Problem (TSP), a type of routing problem. Given the discrete nature of city visits and the objective to minimize cost, an Integer Program (IP) is the standard modeling approach. The application directly relates to movement of people or goods, fitting the transportation sector."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E066",
    "description": "Embark on a journey through a bustling transport network in the heart of a bustling metropolis, featuring 9 critical nodes that form the backbone of this city's logistic framework. From the primary dispatch center to the ultimate distribution hub, each node plays a pivotal role in ensuring goods and resources flow seamlessly across the city.\n\nHere's a detailed glimpse into the transport capacities (in thousands of units) between these nodes, ensuring that every node is a cog in the machine that keeps the city running:\n\n- From Node 0 (The Source): Goods can be dispatched to Node 1 (13 units), Node 2 (19 units), Node 3 (17 units), Node 4 (7 units), Node 5 (7 units), Node 6 (11 units), Node 7 (7 units), and Node 8 (7 units).\n- From Node 1: Goods can move on to Node 0 (9 units), Node 2 (19 units), Node 3 (20 units), Node 4 (10 units), Node 5 (19 units), Node 6 (20 units), Node 7 (19 units), and Node 8 (3 units).\n- From Node 2: Goods can be transported to Node 0 (0 units), Node 1 (16 units), Node 3 (0 units), Node 4 (10 units), Node 5 (2 units), Node 6 (14 units), Node 7 (9 units), and Node 8 (9 units).\n- From Node 3: Goods can be routed to Node 0 (6 units), Node 1 (0 units), Node 2 (5 units), Node 4 (7 units), Node 5 (18 units), Node 6 (15 units), Node 7 (20 units), and Node 8 (7 units).\n- From Node 4: Goods can be forwarded to Node 0 (18 units), Node 1 (19 units), Node 2 (12 units), Node 3 (0 units), Node 5 (16 units), Node 6 (20 units), Node 7 (10 units), and Node 8 (4 units).\n- From Node 5: Goods can be sent to Node 0 (3 units), Node 1 (4 units), Node 2 (8 units), Node 3 (9 units), Node 4 (20 units), Node 6 (7 units), Node 7 (8 units), and Node 8 (1 unit).\n- From Node 6: Goods can be transported to Node 0 (3 units), Node 1 (14 units), Node 2 (14 units), Node 3 (16 units), Node 4 (1 unit), Node 5 (12 units), Node 7 (10 units), and Node 8 (10 units).\n- From Node 7: Goods can move on to Node 0 (9 units), Node 1 (20 units), Node 2 (19 units), Node 3 (4 units), Node 4 (9 units), Node 5 (16 units), Node 6 (1 unit), and Node 8 (6 units).\n- From Node 8 (The Destination): Goods from Node 0 (7 units), Node 1 (15 units), Node 2 (14 units), Node 3 (18 units), Node 4 (18 units), Node 5 (11 units), Node 6 (18 units) can be finally distributed.\n\nA capacity of \"0\" signifies the absence of a direct route between those particular nodes, indicating the need for strategic planning to navigate goods through this intricate network.\n\nYour mission is to calculate the maximum volume of goods (in thousands of units) that can be transported from Node 0, the primary dispatch center, to Node 8, the ultimate distribution hub, per unit time. This calculation must ensure that the flow of goods through each connection does not exceed its transportation capacity. What is the maximum volume of goods that can be moved from the source to the destination in thousands of units?",
    "ground_truth": 47.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Network Flow",
        "modeling_type": "LP",
        "industry_sector": "Transportation",
        "reason": "The task describes a network of nodes and capacities between them, aiming to find the maximum volume of goods from a source to a destination, which is a classic maximum flow problem. This problem can be formulated as a Linear Program (LP)."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E005",
    "description": "Imagine you're a college student aiming to balance your diet and budget. You have identified nine different food items from your local grocery store that you can include in your menu: Chicken, Rice, Apples, Steak, Lentils, Fish, Tofu, Cheese, and Bread. Each of these foods provides varying amounts of protein, carbohydrates, and calories, and each comes with its own price.\n\nHere is the detailed nutritional content and cost for each food item:\n\n- Chicken: Gives you 15 grams of protein, 18 grams of carbohydrates, and 300 calories for $4.\n- Rice: Offers 1 gram of protein, 25 grams of carbohydrates, and 267 calories for $2.\n- Apples: Provide 1 gram of protein, 21 grams of carbohydrates, and 266 calories for $5.\n- Steak: Contains 6 grams of protein, 3 grams of carbohydrates, and 119 calories for a higher cost of $10.\n- Lentils: These give 3 grams of protein, 7 grams of carbohydrates, and 166 calories for just $2.\n- Fish: Delivers 17 grams of protein, 13 grams of carbohydrates, and 129 calories for $8.\n- Tofu: Offers a substantial 18 grams of protein, 27 grams of carbohydrates, and 216 calories for $10.\n- Cheese: Gives 12 grams of protein, 17 grams of carbohydrates, and 76 calories for $9.\n- Bread: Provides 2 grams of protein, a massive 30 grams of carbohydrates, and 258 calories for $4.\n\nYour daily dietary goal is to consume at least 90 grams of protein, 105 grams of carbohydrates, and 1805 calories. Your challenge is to figure out how to meet these nutritional requirements from the food options mentioned above while spending the least amount of money. So, what is the least amount of money you need to spend to meet your daily dietary requirements? Please note that the response should be a single answer, asking for only the optimal value.",
    "ground_truth": 26.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Blending",
        "modeling_type": "LP",
        "industry_sector": "Health",
        "reason": "The problem involves selecting quantities of different food items to meet nutritional requirements at minimum cost, which is a classic blending problem. Since fractional quantities of food items are implicitly allowed and all relationships are linear, it can be formulated as a Linear Program."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E004",
    "description": "Let's say you're on a mission to create the perfect meal plan for yourself. You're focused on getting the right balance of nutrients without digging too deep into your pockets. You have six different food options to consider: Chicken, Oats, Tofu, Rice, Beef, and Salmon. Each of these foods provides a certain amount of protein, carbohydrates, and calories, and they all come with their own distinct prices.\n\nHere's a detailed breakdown of the nutritional content and cost of each food item:\n\n- Chicken: Delivers 14 grams of protein, a single gram of carbohydrates, and 164 calories at a cost of $6.\n- Oats: Gives you 11 grams of protein, 6 grams of carbohydrates, and 210 calories for just $2.\n- Tofu: Offers 8 grams of protein, 12 grams of carbohydrates, and 98 calories at a cost of $9.\n- Rice: Provides 1 gram of protein, a generous 17 grams of carbohydrates, and 92 calories for $3.\n- Beef: Comes packed with 16 grams of protein, 11 grams of carbohydrates, and 211 calories, priced at $7.\n- Salmon: Brings a hefty 19 grams of protein, 13 grams of carbohydrates, and 211 calories but costs $9.\n\nYou want to make sure your meal plan meets the following nutritional targets: at least 70 grams of protein, 117 grams of carbohydrates, and 1837 calories. Considering these six foods, what is the least amount of money you need to spend to meet these dietary needs?\nRemember, your response should only contain the optimal value of the cost to meet the requirements.",
    "ground_truth": 29.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Blending",
        "modeling_type": "LP",
        "industry_sector": "Health",
        "reason": "The problem involves selecting quantities of different food items to meet nutritional requirements at minimum cost, which is a classic blending problem. Since all relationships are linear and decision variables can be continuous (representing fractional servings), it can be formulated as a Linear Program. The application is directly related to dietary planning and nutrition, falling under the health sector."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E103",
    "description": "There are four nodes connected by directed edges. Node 1, which could represent the starting point, is connected to two other nodes: There is an edge from node 1 to node 2 with a capacity of 8. There is an edge from node 1 to node 3 with a capacity of 7. Node 2 is situated at the top of the graph and acts as an intermediate node, with three edges connected to it: An edge leading from node 2 to node 3 with a capacity of 2. An edge leading from node 2 to node 4 with a capacity of 4. Node 3 is another intermediate node and has two edges: An edge from node 3 to node 4 with a substantial capacity of 7. Node 4, which could represent the target or terminal, does not have any edges leading to other nodes, implying that it could be the end point. Find the corresponding maximum flow of the graph. Provide your answer rounded to the nearest integar.",
    "ground_truth": 11.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Network Flow",
        "modeling_type": "LP",
        "industry_sector": "General",
        "reason": "The task explicitly asks to find the 'maximum flow of the graph' given nodes and directed edges with capacities, which is a classic Network Flow problem. This problem can be formulated as a Linear Program (LP) to maximize flow subject to capacity and flow conservation constraints. The problem description is generic and does not specify a particular industry application, hence 'General'."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E110",
    "description": "Sailco Corporation must determine how many sailboats should be produced during each of the next four quarters (one quarter  three months). The demand during each of the next four quarters is as follows: first quarter, 40 sailboats; second quarter, 60 sailboats; third quarter, 75 sailboats; fourth quarter, 25 sailboats. Sailco must meet demands on time. At the beginning of the first quarter, Sailco has an inventory of 10 sailboats. At the beginning of each quarter, Sailco must decide how many sailboats should be produced during that quarter. For simplicity, we assume that sailboats manufactured during a quarter can be used to meet demand for that quarter. During each quarter, Sailco can produce up to 40 sailboats with regular-time labor at a total cost of $400 per sailboat. By having employees work overtime during a quarter, Sailco can produce additional sailboats with overtime labor at a total cost of $450 per sailboat. At the end of each quarter (after production has occurred and the current quarter’s demand has been satisfied), a carrying or holding cost of $20 per sailboat is incurred. Use linear programming to determine a production schedule to minimize the sum of production and inventory costs during the next four quarters. Find the minimal sum.",
    "ground_truth": 78450.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Production Planning",
        "modeling_type": "LP",
        "industry_sector": "Manufacturing",
        "reason": "The problem involves determining production quantities over multiple quarters to meet demand while minimizing production and inventory costs, which is a classic production planning scenario. The costs and constraints are linear, making it suitable for a Linear Programming (LP) formulation."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E057",
    "description": "Imagine a city that has a complex electrical network with 8 power stations (including source and the main receiving stations). The stations are connected with transmission lines, each capable of handling a certain amount of electricity.\n\nHere's the capacity of each transmission line, showing the maximum amount of electricity (in megawatts) that can flow from one station to another:\n\n- From Station 0 (Source): Can send electricity to Station 1 (9 MW), Station 2 (6 MW), Station 3 (1 MW), Station 4 (8 MW), Station 5 (14 MW), Station 6 (1 MW) and Station 7 (17 MW).\n- From Station 1: Can send electricity to Station 0 (1 MW), Station 2 (6 MW), Station 3 (14 MW), Station 4 (16 MW), Station 5 (8 MW), Station 6 (19 MW) and Station 7 (15 MW).\n- From Station 2: Can send electricity to Station 0 (4 MW), Station 1 (7 MW), Station 3 (9 MW), Station 4 (1 MW), Station 5 (2 MW), Station 6 (9 MW) and Station 7 (4 MW).\n- From Station 3: Can send electricity to Station 0 (11 MW), Station 1 (5 MW), Station 2 (14 MW), Station 4 (17 MW), Station 5 (6 MW), Station 6 (20 MW) and Station 7 (13 MW).\n- From Station 4: Can send electricity to Station 0 (8 MW), Station 1 (5 MW), Station 2 (20 MW), Station 3 (0 MW), Station 5 (16 MW), Station 6 (5 MW) and Station 7 (5 MW).\n- From Station 5: Can send electricity to Station 0 (15 MW), Station 1 (18 MW), Station 2 (9 MW), Station 3 (1 MW), Station 4 (19 MW), Station 6 (16 MW) and Station 7 (0 MW).\n- From Station 6: Can send electricity to Station 0 (20 MW), Station 1 (15 MW), Station 2 (1 MW), Station 3 (0 MW), Station 4 (11 MW), Station 5 (6 MW) and Station 7 (19 MW).\n- From Station 7 (Destination): Can send electricity back to Station 0 (4 MW), Station 1 (18 MW), Station 2 (10 MW), Station 3 (2 MW), Station 4 (1 MW), Station 5 (20 MW) and Station 6 (14 MW).\n\nIn this network, a capacity of \"0\" means there is no direct transmission line between those two stations.\n\nThe challenge is to calculate the maximum amount of electricity that can be transmitted from Station 0 (the source) to Station 7 (the main receiving station), ensuring that the flow through each transmission line does not exceed its capacity. What is the maximum amount of electricity that can be transmitted from the source to the destination in megawatts?",
    "ground_truth": 56.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Network Flow",
        "modeling_type": "LP",
        "industry_sector": "Energy",
        "reason": "The problem asks to find the maximum amount of electricity that can be transmitted from a source to a destination through a network with capacity constraints, which is a classic maximum flow problem. This can be formulated as a Linear Program (LP) where the objective is to maximize flow and constraints ensure flow conservation and capacity limits. The application is clearly within an electrical network, hence the energy sector."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E027",
    "description": "Imagine yourself as a dedicated fitness enthusiast on a strict diet and you're trying to plan your meals for an entire day. You aim to meet specific nutritional goals without burning a hole in your pocket. You have five different food items to choose from: Chicken, Pasta, Apples, Tuna, and Rice. Each food item contributes different amounts of proteins, carbohydrates, and calories, and each one has a different price.\n\nHere is an overview of the nutritional values and cost of each food:\n\n- Chicken: Provides 8 grams of protein, 8 grams of carbohydrates, and 118 calories for $6.\n- Pasta: Delivers a hefty 10 grams of protein, a substantial 30 grams of carbohydrates, and 131 calories for $10.\n- Apples: Offer a modest 3 grams of protein, 10 grams of carbohydrates, and a surprising 151 calories for just $1.\n- Tuna: Packs a stunning 16 grams of protein, 29 grams of carbohydrates, and a whopping 235 calories for $9.\n- Rice: Supplies 4 grams of protein, a solid 24 grams of carbohydrates, and 101 calories for a mere $4.\n\nYour dietary goal for the day is to consume at least 93 grams of protein, 181 grams of carbohydrates, and 1620 calories. Your challenge is to figure out the most cost-effective way to achieve these nutritional targets using a combination of these five food options. What is the minimum cost required to meet your daily nutritional requirements? Please note that your response should provide only the optimal value in the context of food selection.",
    "ground_truth": 31.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Blending",
        "modeling_type": "LP",
        "industry_sector": "Health",
        "reason": "The problem involves selecting quantities of different food items to meet minimum nutritional requirements at the lowest cost, which is a classic blending problem. Since the quantities can be fractional and the relationships are linear, it can be formulated as a Linear Program."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E034",
    "description": "Imagine you're a dietitian, tasked with crafting a healthy and balanced meal plan for a client on a budget. The tricky part is that you must choose from a list of nine food items, each with their own cost and nutritional values for protein, carbohydrates, and calories.\n\nHere's the rundown of what each food item provides and its cost:\n\n- Chicken Breast: Delivers 17 grams of protein, 28 grams of carbohydrates, and 136 calories for $3.\n- Tofu: Yields 15 grams of protein, 11 grams of carbohydrates, and 198 calories for $2.\n- Brown Rice: Offers just 1 gram of protein, 11 grams of carbohydrates, and 93 calories for $2.\n- Salmon: Gives you 11 grams of protein, 3 grams of carbohydrates, and a hefty 269 calories for $6.\n- Greek Yogurt: Provides 15 grams of protein, 27 grams of carbohydrates, and 121 calories for $6.\n- Steak: Comes with 12 grams of protein, 3 grams of carbohydrates, and 80 calories for a steeper price of $10.\n- Avocado: Provides 4 grams of protein, 8 grams of carbohydrates, and a whopping 300 calories for $7.\n- Eggs: Offer 16 grams of protein, 25 grams of carbohydrates, and 99 calories for $5.\n- Quinoa: Comes with 11 grams of protein, 20 grams of carbohydrates, and 87 calories for just $2.\n\nYour goal is to make sure your client gets at least 72 grams of protein, 158 grams of carbohydrates, and 1896 calories from the combination of foods you choose. But you also need to keep costs to a minimum. What is the least amount of money you would need to spend to meet all of these nutritional targets from these nine food options?",
    "ground_truth": 24.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Resource Allocation",
        "modeling_type": "LP",
        "industry_sector": "Health",
        "reason": "The problem involves allocating food items (resources) to meet nutritional targets while minimizing cost, which is a classic resource allocation problem. Since fractional amounts of food items are implicitly allowed (not explicitly restricted to integers), it can be modeled as a Linear Program. The application is directly related to diet planning and nutrition, falling under the health sector."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E095",
    "description": "In the bustling world of retail, SupplyChain Solutions is faced with a critical challenge of efficiently supplying seven diverse retail stores. To achieve this goal, the company is considering opening up to six potential distribution centers, each with its unique operating costs and capacities. However, the logistical conundrum doesn't end there, as transporting goods from these centers to the stores incurs varying costs. The ultimate aim for SupplyChain Solutions is to ensure that each retail store's demand is met, while simultaneously minimizing the total operational and transportation expenses. Let's delve into the specifics of this optimization problem.\n\nGiven Data:\n- Number of Potential Distribution Centers: 6\n- Number of Retail Stores to be Supplied: 7\n\nOpening Costs for Each Distribution Center (in dollars):\n- Center 1: $151,000\n- Center 2: $192,000\n- Center 3: $114,000\n- Center 4: $171,000\n- Center 5: $160,000\n- Center 6: $120,000\n\nTransportation Cost Per Unit from Each Distribution Center to Retail Stores (in dollars):\n- From Center 1: $2 to Store 1, $3 to Store 2, $3 to Store 3, $3 to Store 4, $5 to Store 5, $4 to Store 6, $3 to Store 7\n- From Center 2: $5 to Store 1, $2 to Store 2, $4 to Store 3, $2 to Store 4, $4 to Store 5, $5 to Store 6, $1 to Store 7\n- From Center 3: $4 to Store 1, $2 to Store 2, $5 to Store 3, $4 to Store 4, $1 to Store 5, $1 to Store 6, $3 to Store 7\n- From Center 4: $3 to Store 1, $2 to Store 2, $4 to Store 3, $4 to Store 4, $3 to Store 5, $4 to Store 6, $4 to Store 7\n- From Center 5: $1 to Store 1, $3 to Store 2, $5 to Store 3, $3 to Store 4, $5 to Store 5, $1 to Store 6, $2 to Store 7\n- From Center 6: $4 to Store 1, $1 to Store 2, $4 to Store 3, $2 to Store 4, $2 to Store 5, $1 to Store 6, $2 to Store 7\n\nDemand of Each Retail Store (in units):\n- Store 1: 964 units\n- Store 2: 739 units\n- Store 3: 491 units\n- Store 4: 766 units\n- Store 5: 854 units\n- Store 6: 827 units\n- Store 7: 908 units\n\nSupply Capacity of Each Distribution Center (in units):\n- Center 1: 1575 units\n- Center 2: 834 units\n- Center 3: 1005 units\n- Center 4: 1904 units\n- Center 5: 1825 units\n- Center 6: 1821 units\n\nThe puzzle that SupplyChain Solutions needs to solve involves choosing which distribution centers to open and determining the most cost-efficient way to supply each retail store from these centers. The goal is to cover the demand at each store without exceeding the supply capacity of the chosen distribution centers, all while keeping an eye on minimizing the sum of opening and transportation costs.\n\nQuestion:\nWhat is the optimal total cost for SupplyChain Solutions to open the necessary distribution centers and transport goods to meet all seven retail stores' demands? This cost should include both the opening costs of the distribution centers and the transportation costs of supplying the stores.",
    "ground_truth": 461962.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Facility Location",
        "modeling_type": "MILP",
        "industry_sector": "Retail",
        "reason": "The problem involves deciding which distribution centers to open (a facility location decision) and how to allocate supply to meet demand, minimizing total costs. The presence of binary decision variables for opening centers and continuous variables for transportation, along with linear objective and constraints, indicates a Mixed-Integer Linear Programming (MILP) formulation. The application is clearly within the retail supply chain context."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E009",
    "description": "Imagine you're a dietitian, tasked with planning a nutritious and balanced meal for an athlete. The athlete needs to maintain a high protein, moderate carb diet, with enough calories to sustain their intense training regimen. The goal is to meet these dietary requirements at the lowest cost possible. You have five different food items to choose from: Steak, Rice, Chicken, Iceberg Lettuce, and Almonds. Each of these foods contains varying amounts of protein, carbohydrates, and calories, and each comes with a specific cost.\n\nHere's a detailed breakdown of the nutritional value of each food item and its cost:\n\n- Steak: Offers a whopping 20 grams of protein, 12 grams of carbohydrates, and 167 calories for $7.\n- Rice: Provides 6 grams of protein, an impressive 29 grams of carbohydrates, and a hefty 275 calories for $8.\n- Chicken: Packs 17 grams of protein, 26 grams of carbohydrates, and 112 calories for only $2.\n- Iceberg Lettuce: Contains only 1 gram of protein, 8 grams of carbohydrates, and 148 calories for $8.\n- Almonds: Provide 10 grams of protein, 2 grams of carbohydrates, and a high 286 calories for just $2.\n\nThe athlete's daily dietary requirements are as follows: at least 83 grams of protein, 128 grams of carbohydrates, and 1686 calories.\n\nYour challenge is to select a combination of these foods that meets the athletes' nutritional needs, while keeping the costs as low as possible. So, what is the lowest possible cost to meet these dietary requirements? Note: your response should be a single answer question, asking for the optimal value.",
    "ground_truth": 18.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Diet Problem",
        "modeling_type": "LP",
        "industry_sector": "Health",
        "reason": "This is a classic diet problem where the goal is to minimize cost while meeting nutritional requirements. Since the quantities of food items can be continuous (e.g., fractions of a serving), it can be modeled as a Linear Program. The application is directly related to health and nutrition planning."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E079",
    "description": "LogiChain Solutions is in the process of refining its logistics network to efficiently supply goods to nine retail stores, which are scattered across different locations. The company is considering the feasibility of opening up to eight different distribution centers. Each distribution center has a unique set of operational costs and capacities, as well as varying transportation costs for shipping goods to the retail stores. The challenge lies in selecting the most cost-effective combination of distribution centers to open and determining the optimal shipping routes to fulfill the demands of all retail stores while keeping the total operational and transportation costs as low as possible.\n\nGiven Data:\n- Number of Potential Distribution Centers: 8\n- Number of Retail Stores Needing Supply: 9\n\nOpening Costs for Each Distribution Center (in dollars):\n- Center 1: $151,000\n- Center 2: $192,000\n- Center 3: $114,000\n- Center 4: $171,000\n- Center 5: $160,000\n- Center 6: $120,000\n- Center 7: $182,000\n- Center 8: $186,000\n\nTransportation Cost Per Unit from Each Distribution Center to Retail Stores (in dollars):\n- From Center 1 to Stores: $3 to Store 1, $3 to Store 2, $5 to Store 3, $4 to Store 4, $3 to Store 5, $5 to Store 6, $2 to Store 7, $4 to Store 8, $2 to Store 9\n- From Center 2 to Stores: $4 to Store 1, $5 to Store 2, $1 to Store 3, $4 to Store 4, $2 to Store 5, $5 to Store 6, $4 to Store 7, $1 to Store 8, $1 to Store 9\n- From Center 3 to Stores: $3 to Store 1, $3 to Store 2, $2 to Store 3, $4 to Store 4, $4 to Store 5, $3 to Store 6, $4 to Store 7, $4 to Store 8, $1 to Store 9\n- From Center 4 to Stores: $3 to Store 1, $5 to Store 2, $3 to Store 3, $5 to Store 4, $1 to Store 5, $2 to Store 6, $4 to Store 7, $1 to Store 8, $4 to Store 9\n- From Center 5 to Stores: $2 to Store 1, $2 to Store 2, $1 to Store 3, $2 to Store 4, $5 to Store 5, $2 to Store 6, $4 to Store 7, $4 to Store 8, $4 to Store 9\n- From Center 6 to Stores: $4 to Store 1, $5 to Store 2, $3 to Store 3, $1 to Store 4, $4 to Store 5, $2 to Store 6, $4 to Store 7, $2 to Store 8, $2 to Store 9\n- From Center 7 to Stores: $4 to Store 1, $5 to Store 2, $2 to Store 3, $2 to Store 4, $4 to Store 5, $2 to Store 6, $2 to Store 7, $4 to Store 8, $4 to Store 9\n- From Center 8 to Stores: $1 to Store 1, $5 to Store 2, $5 to Store 3, $2 to Store 4, $5 to Store 5, $2 to Store 6, $1 to Store 7, $4 to Store 8, $4 to Store 9\n\nDemand of Each Retail Store (in units):\n- Store 1: 779 units\n- Store 2: 892 units\n- Store 3: 440 units\n- Store 4: 556 units\n- Store 5: 414 units\n- Store 6: 464 units\n- Store 7: 920 units\n- Store 8: 743 units\n- Store 9: 528 units\n\nSupply Capacity of Each Distribution Center (in units):\n- Center 1: 1447 units\n- Center 2: 1886 units\n- Center 3: 1962 units\n- Center 4: 1392 units\n- Center 5: 1191 units\n- Center 6: 1218 units\n- Center 7: 1088 units\n- Center 8: 1178 units\n\nQuestion:\nWhat is the optimal total cost for LogiChain Solutions to open the necessary distribution centers and transport goods to meet all the demands of the nine retail stores? This cost includes both the opening costs of the centers and the transportation costs of supplying the stores.",
    "ground_truth": 556908.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Facility Location",
        "modeling_type": "MILP",
        "industry_sector": "Logistics",
        "reason": "The problem involves deciding which distribution centers to open (a binary decision) and then determining the optimal flow of goods to retail stores, minimizing total fixed opening costs and variable transportation costs. This is a classic uncapacitated or capacitated facility location problem, which is typically formulated as a Mixed-Integer Linear Program."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E035",
    "description": "Welcome to the world of international logistics! You are a resource manager at a global company, responsible for the allocation of a valuable product among your six international warehouses.\n\nHere's what each warehouse currently has and what they need:\n\n- Warehouse 1 currently has 497 units but needs 161 units.\n- Warehouse 2 currently has 39 units but needs 257 units.\n- Warehouse 3 currently has 416 units but needs 252 units.\n- Warehouse 4 currently has 71 units but needs 251 units.\n- Warehouse 5 currently has 445 units but needs 372 units.\n- Warehouse 6 currently has 471 units but needs 370 units.\n\nYou need to orchestrate the movement of these resources to ensure every warehouse meets its required quantity. However, transportation between warehouses carries costs, and these costs vary depending on the pair of warehouses involved. Here's the cost matrix that shows the cost of moving a unit from one warehouse to another:\n\n- Moving product from/to Warehouse 1: To Warehouse 2 costs 5, to Warehouse 3 costs 7, to Warehouse 4 costs 5, to Warehouse 5 costs 27, and to Warehouse 6 costs 49.\n- Moving product from/to Warehouse 2: To Warehouse 1 costs 31, to Warehouse 3 costs 14, to Warehouse 4 costs 31, to Warehouse 5 costs 3, and to Warehouse 6 costs 4.\n- Moving product from/to Warehouse 3: To Warehouse 1 costs 9, to Warehouse 2 costs 13, to Warehouse 4 costs 23, to Warehouse 5 costs 38, and to Warehouse 6 costs 19.\n- Moving product from/to Warehouse 4: To Warehouse 1 costs 47, to Warehouse 2 costs 34, to Warehouse 3 costs 7, to Warehouse 5 costs 34, and to Warehouse 6 costs 35.\n- Moving product from/to Warehouse 5: To Warehouse 1 costs 21, to Warehouse 2 costs 11, to Warehouse 3 costs 6, to Warehouse 4 costs 7, and to Warehouse 6 costs 50.\n- Moving product from/to Warehouse 6: To Warehouse 1 costs 28, to Warehouse 2 costs 41, to Warehouse 3 costs 34, to Warehouse 4 costs 17, to Warehouse 5 costs 32.\n\nYour objective is to relocate the products such that all warehouse needs are met, but with the lowest possible total transportation cost. What is the minimum cost to ensure all warehouses have the quantities they need?",
    "ground_truth": 2114.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Network Flow",
        "modeling_type": "LP",
        "industry_sector": "Logistics",
        "reason": "This problem involves moving products between warehouses to satisfy demands while minimizing transportation costs, which is a classic minimum-cost flow problem. The decision variables (amount of product moved) are continuous, and the objective and constraints are linear, making it a Linear Programming problem. The application is clearly within the domain of managing goods movement and storage, which falls under logistics."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E046",
    "description": "Consider a scenario where a delivery company needs to deliver packages to five different cities. These cities are labeled as E, F, G, H and I. The delivery van can start its route from any of these cities but must follow one rule: it must visit each city exactly once and then return to the starting city. The aim is to find the route that minimizes the total travel cost, which could be a function of fuel costs, labor costs, or road tolls.\n\nHere's a rundown of the travel costs between these cities:\n\nFrom City E (1), the cost to reach City F (2) is 35 units, to G (3) is 90 units, to H (4) is 23 units, and to I (5) is 62 units.\n\nFrom City F (2), the cost to City E (1) is 35 units, to G (3) is 53 units, to H (4) is 58 units, and to I (5) is 46 units.\n\nIf we start from City G (3), the cost to reach City E (1) is 90 units, to F (2) is 53 units, to H (4) is 28 units, and to I (5) is 91 units.\n\nFrom City H (4), the cost to City E (1) is 23 units, to F (2) is 58 units, to G (3) is 28 units, and to I (5) is 77 units.\n\nLastly, from City I (5), it costs 62 units to reach City E (1), 46 units to get to F (2), 91 units to reach G (3), and 77 units to reach H (4).\n\nWhat is the minimum total travel cost for the delivery van to visit each city exactly once and return to the starting city?",
    "ground_truth": 199.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Routing",
        "modeling_type": "IP",
        "industry_sector": "Transportation",
        "reason": "The problem describes a delivery company needing to find the minimum cost route visiting each city exactly once and returning to the start, which is a classic Traveling Salesperson Problem (TSP), a type of routing problem. Given the discrete nature of city visits and the objective to minimize cost, an Integer Programming (IP) formulation is suitable. The application is clearly within the transportation sector due to package delivery and city-to-city travel."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E081",
    "description": "In the bustling landscape of retail and distribution, EfficientDistro Inc. is at a pivotal point of re-evaluating its logistics strategy to ensure the timely and cost-effective delivery of goods to its consumer base. The company has narrowed down its choice to four potential distribution centers, each with its own set of operational costs and capacities. These centers are tasked with the responsibility of distributing products to four retail stores, spread across different locations, each with its unique demand. The challenge lies in selecting the right mix of distribution centers to open and determining the most efficient distribution routes to minimize the overall operational costs, which include both the opening costs of the distribution centers and the transportation costs of goods to the retail stores.\n\nGiven Data:\n- Number of Potential Distribution Centers: 4\n- Number of Retail Stores Needing Supply: 4\n\nOpening Costs for Each Distribution Center (in dollars):\n- Center 1: $151,000\n- Center 2: $192,000\n- Center 3: $114,000\n- Center 4: $171,000\n\nTransportation Cost Per Unit from Each Distribution Center to Retail Stores (in dollars):\n- From Center 1: $5 to Store 1, $5 to Store 2, $2 to Store 3, $3 to Store 4\n- From Center 2: $3 to Store 1, $3 to Store 2, $5 to Store 3, $4 to Store 4\n- From Center 3: $3 to Store 1, $5 to Store 2, $2 to Store 3, $4 to Store 4\n- From Center 4: $2 to Store 1, $4 to Store 2, $5 to Store 3, $1 to Store 4\n\nDemand of Each Retail Store (in units):\n- Store 1: 859\n- Store 2: 713\n- Store 3: 421\n- Store 4: 652\n\nSupply Capacity of Each Distribution Center (in units):\n- Center 1: 1,547\n- Center 2: 1,656\n- Center 3: 1,274\n- Center 4: 1,882\n\nEfficientDistro Inc. now faces the complex task of deciding which distribution centers to open and how to allocate shipments to meet the demand at each retail store in the most cost-effective manner. The solution must take into account the varying opening costs of the distribution centers, their capacities, the transportation costs involved in shipping goods to the retail stores, and the specific demand at each store location.\n\nQuestion:\nWhat is the optimal total cost for EfficientDistro Inc. to open the necessary distribution centers and transport goods to meet all retail stores' demands, including both the opening costs of the centers and the transportation costs of supplying the stores?",
    "ground_truth": 273940.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Facility Location",
        "modeling_type": "MILP",
        "industry_sector": "Retail",
        "reason": "The problem involves deciding which distribution centers to open (a facility location decision) and how to allocate goods from opened centers to retail stores (a transportation problem). The objective is to minimize total costs, including fixed opening costs and variable transportation costs, subject to capacity and demand constraints. This structure is typically modeled using Mixed-Integer Linear Programming due to the binary decision variables for opening centers and continuous variables for transportation quantities."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E080",
    "description": "GlobalSupply Inc. is at a strategic crossroads, looking to streamline its operations by identifying the most cost-effective way to distribute its products to six retail stores from a pool of five potential distribution centers. Each distribution center has not only a unique opening cost but also a specific supply capacity, which limits the amount of product it can dispatch. Moreover, the transport cost for shipping a unit of product from these centers to the retail stores varies, adding another layer of complexity to the decision-making process. The ultimate goal for GlobalSupply Inc. is to ensure that the demand at each retail store is met while keeping the total costs—comprising both the opening costs of the distribution centers and the transportation costs of the products—as low as possible.\n\nGiven Data:\n- Number of Potential Distribution Centers: 5\n- Number of Retail Stores Needing Supply: 6\n\nOpening Costs for Each Distribution Center (in dollars):\n- Center 1: $151,000\n- Center 2: $192,000\n- Center 3: $114,000\n- Center 4: $171,000\n- Center 5: $160,000\n\nTransportation Cost Per Unit from Each Distribution Center to Retail Stores (in dollars):\n- From Center 1: $5 to Store 1, $2 to Store 2, $3 to Store 3, $3 to Store 4, $3 to Store 5, $5 to Store 6\n- From Center 2: $4 to Store 1, $3 to Store 2, $5 to Store 3, $2 to Store 4, $4 to Store 5, $2 to Store 6\n- From Center 3: $4 to Store 1, $5 to Store 2, $1 to Store 3, $4 to Store 4, $2 to Store 5, $5 to Store 6\n- From Center 4: $4 to Store 1, $1 to Store 2, $1 to Store 3, $3 to Store 4, $3 to Store 5, $2 to Store 6\n- From Center 5: $4 to Store 1, $4 to Store 2, $3 to Store 3, $4 to Store 4, $4 to Store 5, $1 to Store 6\n\nDemand of Each Retail Store (in units):\n- Store 1: 530\n- Store 2: 884\n- Store 3: 420\n- Store 4: 566\n- Store 5: 673\n- Store 6: 787\n\nSupply Capacity of Each Distribution Center (in units):\n- Center 1: 1400\n- Center 2: 1115\n- Center 3: 813\n- Center 4: 1041\n- Center 5: 1576\n\nQuestion:\nWhat is the optimal total cost for GlobalSupply Inc. to open the necessary distribution centers and transport goods in order to satisfy the demand of all six retail stores, including both the opening costs of the distribution centers and the transportation costs of supplying the stores?",
    "ground_truth": 490293.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Facility Location",
        "modeling_type": "MILP",
        "industry_sector": "Logistics",
        "reason": "The problem involves deciding which distribution centers to open (a binary decision) and how much product to ship from opened centers to retail stores (continuous variables), minimizing total fixed opening costs and variable transportation costs while satisfying demand and capacity constraints. This is a classic uncapacitated or capacitated facility location problem, formulated as a Mixed-Integer Linear Program."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E075",
    "description": "In the quest to streamline its distribution network, MarketFlow Inc. is faced with a critical decision regarding the allocation of resources to efficiently supply six retail stores. The company has narrowed down its options to four potential distribution centers, each with distinct opening costs and capabilities. The challenge lies in selecting the right mix of distribution centers and determining the optimal transportation routes to ensure that the demands of all retail stores are met at the lowest possible total cost. This cost encompasses both the opening expenses of the distribution centers and the costs associated with transporting goods to the stores.\n\nGiven Data:\n- Number of Potential Distribution Centers: 4\n- Number of Retail Stores Needing Supply: 6\n\nOpening Costs for Each Distribution Center (in dollars):\n- Center 1: $151,000\n- Center 2: $192,000\n- Center 3: $114,000\n- Center 4: $171,000\n\nTransportation Cost Per Unit from Each Distribution Center to Retail Stores (in dollars):\n- From Center 1: $5 to Store 1, $5 to Store 2, $2 to Store 3, $3 to Store 4, $3 to Store 5, $3 to Store 6\n- From Center 2: $5 to Store 1, $4 to Store 2, $3 to Store 3, $5 to Store 4, $2 to Store 5, $4 to Store 6\n- From Center 3: $2 to Store 1, $4 to Store 2, $5 to Store 3, $1 to Store 4, $4 to Store 5, $2 to Store 6\n- From Center 4: $5 to Store 1, $4 to Store 2, $1 to Store 3, $1 to Store 4, $3 to Store 5, $3 to Store 6\n\nDemand of Each Retail Store (in units):\n- Store 1: 910\n- Store 2: 875\n- Store 3: 589\n- Store 4: 962\n- Store 5: 966\n- Store 6: 643\n\nSupply Capacity of Each Distribution Center (in units):\n- Center 1: 1631\n- Center 2: 1954\n- Center 3: 1446\n- Center 4: 820\n\nMarketFlow Inc.'s objective is to fulfill the demand at each of its six retail stores efficiently while minimizing the total expenditure incurred from opening distribution centers and transporting goods. This scenario requires a strategic allocation of resources that entails choosing which distribution centers to open and determining the volume of goods to be transported from these centers to each retail store, all while staying within the supply constraints of the centers.\n\nQuestion:\nWhat is the optimal total cost for MarketFlow Inc. to open the necessary distribution centers and transport goods to all six retail stores, thereby meeting their demands while ensuring the cost is minimized, including both the opening costs of the centers and the transportation costs of supplying the stores?",
    "ground_truth": 469200.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Facility Location & Transportation",
        "modeling_type": "MILP",
        "industry_sector": "Retail",
        "reason": "The problem involves selecting which distribution centers to open (a facility location decision) and then determining the optimal flow of goods from opened centers to retail stores (a transportation problem). The objective is to minimize total costs, which include fixed opening costs and variable transportation costs. This requires binary decision variables for opening centers and continuous variables for transportation quantities, making it a Mixed-Integer Linear Program. The application is clearly within the retail sector for supply chain optimization."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E073",
    "description": "SupplyLink, a major supplier, is looking to optimize its distribution network to ensure the efficient supply of goods to its five retail stores from a selection of five potential distribution centers. Each distribution center incurs an initial opening cost and has a limit on how much it can supply. The transportation cost of goods from these centers to the retail stores also varies. The goal is to meet the demand at each retail store at minimal total cost, which includes the opening costs of distribution centers and the transportation cost of the goods.\n\nGiven Data:\n- Number of Potential Distribution Centers: 5\n- Number of Retail Stores Needing Supply: 5\n\nOpening Costs for Each Distribution Center (in dollars):\n- Center 1: 151,000\n- Center 2: 192,000\n- Center 3: 114,000\n- Center 4: 171,000\n- Center 5: 160,000\n\nTransportation Cost Per Unit from Each Distribution Center to Retail Stores (in dollars):\n- From Center 1: $5 to Store 1, $2 to Store 2, $3 to Store 3, $3 to Store 4, $3 to Store 5\n- From Center 2: $5 to Store 1, $4 to Store 2, $3 to Store 3, $5 to Store 4, $2 to Store 5\n- From Center 3: $4 to Store 1, $2 to Store 2, $4 to Store 3, $5 to Store 4, $1 to Store 5\n- From Center 4: $4 to Store 1, $2 to Store 2, $5 to Store 3, $4 to Store 4, $1 to Store 5\n- From Center 5: $1 to Store 1, $3 to Store 2, $3 to Store 3, $2 to Store 4, $4 to Store 5\n\nDemand of Each Retail Store (in units):\n- Store 1: 589\n- Store 2: 962\n- Store 3: 966\n- Store 4: 643\n- Store 5: 904\n\nSupply Capacity of Each Distribution Center (in units):\n- Center 1: 1954\n- Center 2: 1446\n- Center 3: 820\n- Center 4: 1640\n- Center 5: 966\n\nQuestion:\nWhat is the minimum total cost that SupplyLink will incur to open distribution centers and transport goods in order to satisfy all retail stores' demands? This total cost includes both the opening costs of the centers and the transportation costs of supplying the stores.",
    "ground_truth": 446011.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Facility Location",
        "modeling_type": "MILP",
        "industry_sector": "Retail",
        "reason": "The problem involves deciding which distribution centers to open (a binary decision) and how much to transport from opened centers to stores, minimizing total costs (fixed opening costs + variable transportation costs) while satisfying demand and capacity constraints. This is a classic uncapacitated or capacitated facility location problem, which is typically formulated as a Mixed-Integer Linear Program. The application is clearly within the retail sector, dealing with supply chain optimization for a supplier to retail stores."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E101",
    "description": "There are four nodes connected by directed edges. Node 1, which could represent the starting point, is connected to two other nodes: There is an edge from node 1 to node 2 with a capacity of 8. There is an edge from node 1 to node 3 with a capacity of 7. Node 2 is situated at the top of the graph and acts as an intermediate node, with three edges connected to it: An edge leading from node 2 to node 3 with a capacity of 2. An edge leading from node 2 to node 4 with a capacity of 4. Node 3 is another intermediate node and has two edges: An edge from node 3 to node 4 with a substantial capacity of 12. Node 4, which could represent the target or terminal, does not have any edges leading to other nodes, implying that it could be the end point. Find the corresponding maximum flow of the graph. Provide your answer rounded to the nearest integar.",
    "ground_truth": 13.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Network Flow",
        "modeling_type": "LP",
        "industry_sector": "General",
        "reason": "The problem explicitly asks for the 'maximum flow of the graph' given nodes and directed edges with capacities, which is a classic Network Flow problem. This can be formulated as a Linear Program (LP) where the objective is to maximize flow subject to capacity and flow conservation constraints. The problem description is generic and does not specify a particular application, hence 'General' for industry sector."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E042",
    "description": "Consider a scenario where a logistics company needs to organize a delivery route across five warehouses. These warehouses are located in different cities labeled as A, B, C, D, and E. A delivery truck has to start from any one of these warehouses, deliver goods at each of the remaining four exactly once, and finally return to the starting warehouse. The challenge here is to plan the route in a way that minimizes the total travel cost. The cost could be based on various factors like distance, fuel usage, or time spent.\n\nHere are the details of the travel costs between the warehouses:\n\nThe cost to travel from Warehouse A to B is 15 units, to C is 88 units, to D is 54 units, and to E is 92 units.\n\nFrom Warehouse B, the cost to reach A is 15 units, to C is 29 units, to D is 98 units, and to E is 33 units.\n\nFor Warehouse C, the cost to get to A is 88 units, to B is 29 units, to D is 96 units, and to E is 96 units.\n\nMoving from Warehouse D, it costs 54 units to reach A, 98 units to get to B, 96 units to C, and 63 units to E.\n\nLastly, from Warehouse E, the cost to go to A is 92 units, to B is 33 units, to C is 96 units, and to D is 63 units.\n\nHow can the logistics company plan the route so that the total travel cost is minimized for the delivery truck to visit each warehouse exactly once and return to the starting warehouse?",
    "ground_truth": 257.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Routing",
        "modeling_type": "IP",
        "industry_sector": "Logistics",
        "reason": "The problem describes a classic Traveling Salesperson Problem (TSP) where a delivery truck must visit multiple locations exactly once and return to the start, minimizing total cost, which falls under the 'Routing' domain. Given the discrete nature of decisions (visit or not visit a path), an Integer Program (IP) is the appropriate modeling type. The application directly relates to organizing deliveries for a 'logistics company', hence 'Logistics' is the industry sector."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E077",
    "description": "In a challenging and complex market, SwiftLogistics is at a crossroads to design an efficient distribution network to fulfill the needs of eight retail stores scattered across various locations. The company has the opportunity to choose from six potential distribution centers, each with its unique opening costs and capacities. The primary goal is to ensure all retail stores are adequately supplied while minimizing the total operational costs, which include both the opening of distribution centers and the transportation of goods.\n\nGiven Data:\n- Number of Potential Distribution Centers: 6\n- Number of Retail Stores Needing Supply: 8\n\nOpening Costs for Each Distribution Center (in dollars):\n- Center 1: $151,000\n- Center 2: $192,000\n- Center 3: $114,000\n- Center 4: $171,000\n- Center 5: $160,000\n- Center 6: $120,000\n\nTransportation Cost Per Unit from Each Distribution Center to Retail Stores (in dollars):\n- From Center 1: $2 to Store 1, $3 to Store 2, $3 to Store 3, $3 to Store 4, $5 to Store 5, $4 to Store 6, $3 to Store 7, $5 to Store 8\n- From Center 2: $2 to Store 1, $4 to Store 2, $2 to Store 3, $4 to Store 4, $5 to Store 5, $1 to Store 6, $4 to Store 7, $2 to Store 8\n- From Center 3: $5 to Store 1, $4 to Store 2, $1 to Store 3, $1 to Store 4, $3 to Store 5, $3 to Store 6, $2 to Store 7, $4 to Store 8\n- From Center 4: $4 to Store 1, $3 to Store 2, $4 to Store 3, $4 to Store 4, $1 to Store 5, $3 to Store 6, $5 to Store 7, $3 to Store 8\n- From Center 5: $5 to Store 1, $1 to Store 2, $2 to Store 3, $4 to Store 4, $1 to Store 5, $4 to Store 6, $2 to Store 7, $2 to Store 8\n- From Center 6: $1 to Store 1, $2 to Store 2, $5 to Store 3, $2 to Store 4, $4 to Store 5, $4 to Store 6, $4 to Store 7, $4 to Store 8\n\nDemand of Each Retail Store (in units):\n- Store 1: 908 units\n- Store 2: 434 units\n- Store 3: 605 units\n- Store 4: 480 units\n- Store 5: 961 units\n- Store 6: 787 units\n- Store 7: 401 units\n- Store 8: 789 units\n\nSupply Capacity of Each Distribution Center (in units):\n- Center 1: 1365 units\n- Center 2: 1929 units\n- Center 3: 1502 units\n- Center 4: 1201 units\n- Center 5: 1529 units\n- Center 6: 961 units\n\nSwiftLogistics now faces the intricate task of determining which distribution centers to open and how to distribute goods to meet the demands of all eight retail stores efficiently. The strategy must ensure that the total cost, including opening and transportation expenses, is minimized.\n\nQuestion:\nWhat is the optimal total cost for SwiftLogistics to open the necessary distribution centers and transport goods to satisfy the demands of all eight retail stores, keeping in mind the goal of minimizing the combined opening and transportation costs?",
    "ground_truth": 587428.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Facility Location",
        "modeling_type": "MILP",
        "industry_sector": "Logistics",
        "reason": "The problem involves deciding which distribution centers to open (a binary decision) and how much to transport from opened centers to retail stores (continuous variables), with the objective of minimizing total costs (fixed opening costs + variable transportation costs), subject to capacity and demand constraints. This is a classic uncapacitated facility location problem variant, formulated as a Mixed-Integer Linear Program."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E033",
    "description": "You've decided to take control of your health and focus on your nutritional intake. After researching and consulting with a dietitian, you've determined that your daily requirements are 78 grams of protein, 140 grams of carbs, and 1537 calories. Now, the next challenge is to meet these daily requirements in the most cost-effective way possible.\n\nYour local supermarket offers a variety of food items, each with its own cost and nutritional content. Here's what you have to choose from:\n\n- Chicken Breast: For $4, you'll get 14 grams of protein, 4 grams of carbohydrates, and 275 calories.\n- Brown Rice: A $10 serving gives you 11 grams of protein, 17 grams of carbohydrates, and 151 calories. \n- Tofu: For $6, you can get 20 grams of protein, 12 carbs, and 155 calories. \n- Spinach: At only $1, you get 6 grams of protein, 20 carbs, and 106 calories. This is the cheapest option but also the least calorie-dense. \n- Almonds: For $8, you get 9 grams of protein, 11 grams of carbohydrates, and 279 calories. \n- Salmon: Finally, for $6, you get a whopping 20 grams of protein, 19 grams of carbohydrates, and 93 calories. \n\nWith these food options available, your task is to figure out how to meet your daily nutritional requirements while keeping your costs to a minimum. So what is the least amount of money you need to spend to meet your daily nutritional needs?",
    "ground_truth": 15.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Blending",
        "modeling_type": "LP",
        "industry_sector": "Health",
        "reason": "The problem involves selecting quantities of different food items to meet specific nutritional requirements at minimum cost, which is a classic blending problem. Since fractional quantities of food items are implicitly allowed and all relationships are linear, it can be modeled as a Linear Program. The application directly relates to personal health and nutrition management."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E007",
    "description": "Imagine you're a college student living off-campus with a tight budget, but you're committed to maintaining a healthy diet. You have identified a set of nine different food items available in your local supermarket. Each of these items provides specific amounts of protein, carbohydrates, and calories and has its own price. \n\nHere is the breakdown of what each food item provides along with its cost:\n\n1. Chicken (Cost: $10): Gives you 7 grams of protein, 17 grams of carbohydrates, and 95 calories.\n2. Tofu (Cost: $2): Provides 12 grams of protein, 12 grams of carbohydrates, and 233 calories.\n3. Brown Rice (Cost: $7): Contains 14 grams of protein, 27 grams of carbohydrates, and 134 calories.\n4. Fish (Cost: $8): Offers 9 grams of protein, 6 grams of carbohydrates, and 109 calories.\n5. Lentils (Cost: $4): Deliver 11 grams of protein, 19 grams of carbohydrates, and 202 calories.\n6. Quinoa (Cost: $9): Packs 10 grams of protein, 23 grams of carbohydrates, and 148 calories.\n7. Eggs (Cost: $2): Provides 10 grams of protein, 6 grams of carbohydrates, and 184 calories.\n8. Beef (Cost: $9): Contains 9 grams of protein, 16 grams of carbohydrates, and 136 calories.\n9. Beans (Cost: $9): Offers 8 grams of protein, 25 grams of carbohydrates, and 229 calories.\n\nYour daily dietary requirements are that you need at least 71 grams of protein, 107 grams of carbohydrates, and 1623 calories. Your challenge is to meet these nutritional targets by choosing from these nine food items and spending as little money as possible. How much is the minimum cost you need to spend to meet your nutritional needs? Remember, your response should only provide the optimal value.",
    "ground_truth": 18.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Blending",
        "modeling_type": "LP",
        "industry_sector": "Health",
        "reason": "The problem involves selecting quantities of different food items to meet nutritional requirements at minimum cost, which is a classic blending problem. Since the quantities can be fractional and the objective and constraints are linear, it can be modeled as a Linear Program. The application directly relates to dietary planning and nutritional intake, placing it in the health sector."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E084",
    "description": "In the scenario presented, SupplyChain Solutions is faced with a complex decision in establishing its distribution network to efficiently serve six retail stores from a selection of seven distribution centers. Each distribution center has its own specific opening cost and a maximum supply capacity. Furthermore, the cost of transporting goods from these centers to the retail stores varies significantly. The goal is to fulfill the demand at each retail store while minimizing the total cost incurred, which encompasses both the opening costs of the distribution centers and the transportation costs of the goods.\n\nGiven Data:\n- Number of Potential Distribution Centers: 7\n- Number of Retail Stores Needing Supply: 6\n\nOpening Costs for Each Distribution Center (in dollars):\n- Center 1: $151,000\n- Center 2: $192,000\n- Center 3: $114,000\n- Center 4: $171,000\n- Center 5: $160,000\n- Center 6: $120,000\n- Center 7: $182,000\n\nTransportation Cost Per Unit from Each Distribution Center to Retail Stores (in dollars):\n- From Center 1: $3 to Store 1, $3 to Store 2, $5 to Store 3, $4 to Store 4, $3 to Store 5, $5 to Store 6\n- From Center 2: $2 to Store 1, $4 to Store 2, $2 to Store 3, $4 to Store 4, $5 to Store 5, $1 to Store 6\n- From Center 3: $4 to Store 1, $2 to Store 2, $5 to Store 3, $4 to Store 4, $1 to Store 5, $1 to Store 6\n- From Center 4: $3 to Store 1, $3 to Store 2, $2 to Store 3, $4 to Store 4, $4 to Store 5, $3 to Store 6\n- From Center 5: $4 to Store 1, $4 to Store 2, $1 to Store 3, $3 to Store 4, $5 to Store 5, $3 to Store 6\n- From Center 6: $5 to Store 1, $1 to Store 2, $2 to Store 3, $4 to Store 4, $1 to Store 5, $4 to Store 6\n- From Center 7: $2 to Store 1, $2 to Store 2, $1 to Store 3, $2 to Store 4, $5 to Store 5, $2 to Store 6\n\nDemand of Each Retail Store (in units):\n- Store 1: 739\n- Store 2: 491\n- Store 3: 766\n- Store 4: 854\n- Store 5: 827\n- Store 6: 908\n\nSupply Capacity of Each Distribution Center (in units):\n- Center 1: 1575\n- Center 2: 834\n- Center 3: 1005\n- Center 4: 1904\n- Center 5: 1825\n- Center 6: 1821\n- Center 7: 1365\n\nQuestion:\nWhat is the optimal total cost for SupplyChain Solutions to select distribution centers and transport goods to meet the demands of all retail stores, considering both the opening costs of the centers and the transportation costs of supplying the stores?",
    "ground_truth": 402947.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Facility Location",
        "modeling_type": "MILP",
        "industry_sector": "Supply Chain",
        "reason": "The problem involves deciding which distribution centers to open (a binary decision) and how much to transport from opened centers to retail stores, minimizing total costs (opening + transportation) while satisfying demand and capacity constraints. This is a classic fixed-charge facility location problem, which is formulated as a Mixed-Integer Linear Program."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E052",
    "description": "Embark on a journey through a complex network of digital data highways, designed to facilitate the swift and secure transmission of information across 9 strategic relay stations. This network, vital for the operation of a futuristic city, relies on its capacity to handle vast amounts of data, ensuring that communication flows from its source to the intended destination without a hitch.\n\nHere's a detailed blueprint of the data flow capacities (in terabytes per hour) from one relay station to another within this intricate system:\n\n- From Station 0 (Source): Has the capability to dispatch data to Station 1 (15 TB), Station 2 (1 TB), Station 3 (9 TB), Station 4 (18 TB), Station 5 (12 TB), Station 6 (18 TB), Station 7 (6 TB), and Station 8 (17 TB).\n- From Station 1: Can transmit data to Station 0 (14 TB), Station 2 (13 TB), Station 3 (11 TB), Station 4 (14 TB), Station 5 (10 TB), Station 6 (15 TB), Station 7 (4 TB), and Station 8 (15 TB).\n- From Station 2: Can route data to Station 0 (3 TB), Station 3 (2 TB), Station 4 (14 TB), Station 5 (16 TB), Station 6 (7 TB), Station 7 (12 TB), and Station 8 (4 TB).\n- From Station 3: Can forward data to Station 0 (5 TB), Station 1 (20 TB), Station 4 (9 TB), Station 5 (1 TB), Station 6 (12 TB), Station 7 (1 TB), and Station 8 (20 TB).\n- From Station 4: Can push data to Station 0 (11 TB), Station 1 (18 TB), Station 2 (12 TB), Station 3 (3 TB), Station 5 (4 TB), Station 6 (16 TB), Station 7 (15 TB), and Station 8 (2 TB).\n- From Station 5: Can channel data to Station 0 (13 TB), Station 1 (8 TB), Station 2 (8 TB), Station 3 (6 TB), Station 4 (4 TB), Station 6 (8 TB), Station 7 (10 TB), and Station 8 (11 TB).\n- From Station 6: Can send data to Station 0 (12 TB), Station 1 (1 TB), Station 2 (3 TB), Station 3 (4 TB), Station 4 (11 TB), Station 5 (8 TB), Station 7 (10 TB), and Station 8 (19 TB).\n- From Station 7: Can relay data to Station 0 (18 TB), Station 1 (3 TB), Station 2 (9 TB), Station 3 (5 TB), Station 4 (9 TB), Station 5 (17 TB), Station 6 (10 TB), and Station 8 (13 TB).\n- From Station 8 (Destination): Data can be reflected back to Station 0 (9 TB), Station 1 (8 TB), Station 2 (12 TB), Station 3 (2 TB), Station 4 (5 TB), Station 5 (2 TB), Station 6 (16 TB), and Station 7 (5 TB).\n\nIn this virtual scenario, a capacity of \"0\" indicates that there is no direct data link between the specified stations, requiring the data to be rerouted through other nodes in the network.\n\nYour mission is to calculate the maximum amount of data (in terabytes per hour) that can be transmitted from Station 0 (the source) to Station 8 (the destination), ensuring that the traffic flowing through each data link does not exceed its maximum capacity. What is the optimal amount of data that can be relayed from the source to the destination per hour?",
    "ground_truth": 96.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Network Flow",
        "modeling_type": "LP",
        "industry_sector": "Telecommunications",
        "reason": "The problem asks to find the maximum amount of data that can be transmitted from a source to a destination through a network with given capacities on each link, which is a classic maximum flow problem. This can be formulated as a Linear Program (LP). The application context of digital data highways and relay stations clearly points to the telecommunications sector."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E028",
    "description": "Imagine you are planning your meals for the week, and you need to make sure you're receiving the right amount of nutrients without breaking the bank. You're considering six different food items, namely Pasta, Avocado, Chicken, Tofu, Spinach, and Cheese. Each of these foods offers a certain amount of protein, carbohydrates, and calories, and each comes with its own cost.\n\nHere's what each food offers and its cost:\n\n- Pasta: Gives you 15 grams of protein, 30 grams of carbohydrates, and 154 calories for $3.\n- Avocado: Offers 20 grams of protein, 16 grams of carbohydrates, and 111 calories for $8.\n- Chicken: Packs 15 grams of protein, 8 grams of carbohydrates, and 211 calories for $7.\n- Tofu: Delivers 19 grams of protein, 5 grams of carbohydrates, and 87 calories for only $2.\n- Spinach: Provides 19 grams of protein, 28 grams of carbohydrates, and 98 calories for $9.\n- Cheese: Contributes 12 grams of protein, 17 grams of carbohydrates, and 231 calories for $10.\n\nYour goal is to ensure that you get at least 73 grams of protein, 111 grams of carbohydrates, and 2196 calories from whatever combination of these foods you choose. The challenge is to figure out the most cost-effective way to hit all these nutritional targets with these six food options. What is the minimum cost to meet your nutritional needs?\nNote: your response should be a single answer question, asking for only the optimal value. The scenario revolves around the selection of food.",
    "ground_truth": 44.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Blending",
        "modeling_type": "LP",
        "industry_sector": "Health",
        "reason": "The problem involves selecting a mix of food items to meet nutritional requirements at minimum cost, which is a classic blending problem. Since the decision variables (quantities of food) can be continuous and the objective and constraints are linear, it can be formulated as a Linear Program. The application is directly related to dietary planning and nutrition, falling under the health sector."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E096",
    "description": "In the bustling world of retail, SupplyChain Solutions is faced with the challenge of efficiently distributing products to eight eager retail stores. With four potential distribution centers to choose from, each with its own unique costs and capacities, the company aims to devise a strategic plan to minimize overall expenses. This plan must account for the initial cost of opening distribution centers and the ongoing expenses of transporting goods to stores. The objective is clear: to fulfill the demand of each retail store at the lowest possible total cost.\n\nGiven Data:\n- Number of Potential Distribution Centers: 4\n- Number of Retail Stores Needing Supply: 8\n\nOpening Costs for Each Distribution Center (in dollars):\n- Center 1: $151,000\n- Center 2: $192,000\n- Center 3: $114,000\n- Center 4: $171,000\n\nTransportation Cost Per Unit from Each Distribution Center to Retail Stores (in dollars):\n- From Center 1: $5 to Store 1, $5 to Store 2, $2 to Store 3, $3 to Store 4, $3 to Store 5, $3 to Store 6, $5 to Store 7, $4 to Store 8\n- From Center 2: $3 to Store 1, $5 to Store 2, $2 to Store 3, $4 to Store 4, $2 to Store 5, $4 to Store 6, $5 to Store 7, $1 to Store 8\n- From Center 3: $4 to Store 1, $2 to Store 2, $5 to Store 3, $4 to Store 4, $1 to Store 5, $1 to Store 6, $3 to Store 7, $3 to Store 8\n- From Center 4: $2 to Store 1, $4 to Store 2, $4 to Store 3, $3 to Store 4, $4 to Store 5, $4 to Store 6, $1 to Store 7, $3 to Store 8\n\nDemand of Each Retail Store (in units):\n- Store 1: 884 units\n- Store 2: 420 units\n- Store 3: 566 units\n- Store 4: 673 units\n- Store 5: 787 units\n- Store 6: 1000 units\n- Store 7: 715 units\n- Store 8: 413 units\n\nSupply Capacity of Each Distribution Center (in units):\n- Center 1: 1041 units\n- Center 2: 1576 units\n- Center 3: 1364 units\n- Center 4: 1697 units\n\nQuestion:\nWhat is the optimal total cost for SupplyChain Solutions to open distribution centers and transport goods to meet all retail stores' demands? This cost includes both the opening costs of the centers and the transportation costs of supplying the stores.",
    "ground_truth": 637573.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Facility Location",
        "modeling_type": "MILP",
        "industry_sector": "Retail",
        "reason": "The problem involves deciding which distribution centers to open (a facility location decision) and then how to allocate products from opened centers to stores to meet demand, minimizing total costs. The decision to open a center is binary, and transportation quantities are continuous, leading to a Mixed-Integer Linear Program. The application is clearly within the retail sector's supply chain operations."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E050",
    "description": "Imagine a salesperson tasked with visiting four distinct cities—let's call them A, B, C, and D—to promote their products. The salesperson can commence their journey from any of these cities, with the requirement that they visit each city exactly once before returning to the starting point. The primary objective is to minimize the total travel cost incurred during this journey.\n\nHere's a breakdown of the travel costs between the cities:\n- To travel from City A to B, it costs 61 units.\n- To journey from City A to C, the cost is 65 units.\n- The travel cost from City A to D is 63 units.\n- If the salesperson begins from City B, it costs 61 units to reach A, 94 units to get to C, and 31 units to D.\n- From City C, the costs are 65 units to A, 94 units to B, and 19 units to D.\n- Finally, from City D, the costs are 63 units to A, 31 units to B, and 19 units to C.\n\nNow, what is the minimum total travel cost for the salesperson to visit each city exactly once and return to the starting city?",
    "ground_truth": 160.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Routing",
        "modeling_type": "IP",
        "industry_sector": "Transportation",
        "reason": "The problem describes a salesperson visiting multiple cities and returning to the start, aiming to minimize total travel cost, which is a classic Traveling Salesperson Problem (TSP). TSP is a fundamental problem in Routing. Given the discrete nature of city visits and the objective to minimize cost, an Integer Program (IP) is the standard modeling approach. The context of a salesperson traveling between cities directly relates to the Transportation sector."
      }
    ],
    "cluster": null
  },
  {
    "task_id": "E074",
    "description": "In the strategic planning of WareCo's distribution network, the company is evaluating how to efficiently supply seven retail stores from seven available distribution centers. Each distribution center has a unique opening cost and capacity that limits the volume of goods it can distribute. Additionally, the cost to transport goods from these centers to each retail store varies, making the task of minimizing the overall operational cost a complex puzzle. The goal is to determine the optimal setup that satisfies the demand at each retail store while incurring the lowest possible total cost, including both the opening of selected distribution centers and the transportation of goods.\n\nGiven Data:\n\n- Number of Potential Distribution Centers: 7\n- Number of Retail Stores to be Supplied: 7\n\nOpening Costs for Each Distribution Center (in dollars):\n- Center 1: $151,000\n- Center 2: $192,000\n- Center 3: $114,000\n- Center 4: $171,000\n- Center 5: $160,000\n- Center 6: $120,000\n- Center 7: $182,000\n\nTransportation Cost Per Unit from Each Distribution Center to Retail Stores (in dollars):\n- From Center 1: $3 to Store 1, $3 to Store 2, $5 to Store 3, $4 to Store 4, $3 to Store 5, $5 to Store 6, $2 to Store 7\n- From Center 2: $4 to Store 1, $2 to Store 2, $4 to Store 3, $5 to Store 4, $1 to Store 5, $4 to Store 6, $2 to Store 7\n- From Center 3: $5 to Store 1, $4 to Store 2, $1 to Store 3, $1 to Store 4, $3 to Store 5, $3 to Store 6, $2 to Store 7\n- From Center 4: $4 to Store 1, $4 to Store 2, $3 to Store 3, $4 to Store 4, $4 to Store 5, $1 to Store 6, $3 to Store 7\n- From Center 5: $5 to Store 1, $3 to Store 2, $5 to Store 3, $1 to Store 4, $2 to Store 5, $4 to Store 6, $1 to Store 7\n- From Center 6: $4 to Store 1, $2 to Store 2, $2 to Store 3, $1 to Store 4, $2 to Store 5, $5 to Store 6, $2 to Store 7\n- From Center 7: $4 to Store 1, $4 to Store 2, $4 to Store 3, $4 to Store 4, $5 to Store 5, $3 to Store 6, $1 to Store 7\n\nDemand of Each Retail Store (in units):\n- Store 1: 961\n- Store 2: 787\n- Store 3: 401\n- Store 4: 789\n- Store 5: 965\n- Store 6: 505\n- Store 7: 876\n\nSupply Capacity of Each Distribution Center (in units):\n- Center 1: 1502\n- Center 2: 1201\n- Center 3: 1529\n- Center 4: 961\n- Center 5: 1001\n- Center 6: 1795\n- Center 7: 1069\n\nQuestion:\nWhat is the optimal total cost for WareCo to meet the demand at all seven retail stores, considering both the opening costs of the distribution centers and the transportation costs of supplying the stores?",
    "ground_truth": 554968.0,
    "formulation": null,
    "correct_program": null,
    "output_status": [],
    "success_count": 0,
    "success_confidence": 0,
    "fail_to_diagnose": 0,
    "fail_to_verify": 0,
    "retrieved_insights": [],
    "tag": [
      {
        "problem_domain": "Facility Location",
        "modeling_type": "MILP",
        "industry_sector": "Logistics",
        "reason": "The problem involves deciding which distribution centers to open (a binary decision) and how much to transport from opened centers to stores (continuous variables), minimizing total fixed opening costs and variable transportation costs, subject to capacity and demand constraints. This is a classic uncapacitated or capacitated facility location problem, formulated as a Mixed-Integer Linear Program."
      }
    ],
    "cluster": null
  }
]